[
{"id": "surgery_00549", "q": "Which orthopaedic trauma situation would a comparison of X-ray views with the normal side be recommended for the decision-making?", "options": ["growth plate injuries", "stress fractures", "fragility fractures", "nightstick fractures"], "correct": 0, "difficulty": 1},
{"id": "surgery_00550", "q": "During musculoskeletal examination, which of the following statements is correct?", "options": ["examine the sound limb first", "passive range of motion is examined before active", "muscle power is graded from one to five", "apprehension test is a stress test"], "correct": 0, "difficulty": 1},
{"id": "surgery_00551", "q": "Which imaging modality is helpful during bone tumour resection planning regarding intraosseous extent, relation to surrounding soft tissues, and joint involvement?", "options": ["Bone scan", "Plain radiograph", "Ultrasound", "Magnetic resonance imagining"], "correct": 3, "difficulty": 2},
{"id": "surgery_00552", "q": "A professional football player is unable to extend his right knee completely after a twist in a match. The physician asked for an MRI for fear of an acute meniscal tear. What is his complaint?", "options": ["stiffness", "locking", "deformity", "instability"], "correct": 1, "difficulty": 2},
{"id": "surgery_00553", "q": "Isolated short spiral fracture of the fibula at the level of the inferior tibiofibular joint (syndesmosis) in a healthy athlete is caused by", "options": ["an aggressive protective pull of the peroneus brevis tendon", "direct kick in an aggressive field tackling", "an indirect injury during an ankle twist", "Repetitive running on sunt hand ground"], "correct": 2, "difficulty": 2},
{"id": "surgery_00554", "q": "An essential step in primary management of open fracture tibia, Gustilo 3C, in a 24-year-old male", "options": ["internal stabilization using Interlocking nail", "by internal stabilization using plate and screw", "vascular exploration", "wound debridement and primary closure"], "correct": 2, "difficulty": 3},
{"id": "surgery_00555", "q": "Fragility vertebral fracture", "options": ["is mechanically unstable", "requires urgent spinal cord decompression", "commonly seen in military recruits", "commonly seen in elderly females"], "correct": 3, "difficulty": 2},
{"id": "surgery_00556", "q": "The action of restoration of the perfect anatomical relationship between the fracture fragments is indicated in", "options": ["Salter-Harris type II injury in the proximal tibia", "Gustilo 1 mid-shaft fracture of the tibia", "displaced fracture of the neck of the femur in a 75-year-old male", "neglected (>3 weeks old) fracture of the scapula"], "correct": 2, "difficulty": 2},
{"id": "surgery_00557", "q": "What type of fracture healing occurs in a tibial shaft fracture treated with an intramedullary nail?", "options": ["direct bone healing by callus formation", "indirect bone healing by callus formation", "direct bone healing by cutting cone remodelling", "indirect bone healing by cutting cone remodelling"], "correct": 1, "difficulty": 2},
{"id": "surgery_00558", "q": "The process of bone remodelling during fracture healing", "options": ["reshaping the bone to fit its original shape and function", "endochondral ossification that transforms the soft callus into hard bone", "formation of an immature and disorganized fibro-osteo-cartilaginous tissue", "inflammatory reaction with the proliferation of stem cells under the periosteum"], "correct": 0, "difficulty": 1},
{"id": "surgery_00559", "q": "The patient complained of severe pain and foot paraesthesia after open reduction and internal fixations of high-energy midshaft tibia and fibula fractures. The physician reported severe swelling with intolerable pain with toes dorsiflexion. What is the treatment?", "options": ["enhance the pain control", "leg elevation and reassurance", "add aggressive antibiotic drugs", "immediate fasciotomy"], "correct": 3, "difficulty": 3},
{"id": "surgery_00560", "q": "Common associated injuries caused by the same mechanism of injury", "options": ["fall from height causes spine and calcaneus fractures", "dashboard injury causes shoulder and hip fractures", "fall on outstretched hand causes shoulder and cervical spine fractures", "road traffic accident causes pelvis and spine fractures"], "correct": 0, "difficulty": 1},
{"id": "surgery_00561", "q": "The process of fracture reduction of a midshaft fracture femur in a middle-age male should in volve all the following except", "options": ["restore length", "restore marrow integrity", "restore rotation", "restore angulation"], "correct": 1, "difficulty": 2},
{"id": "surgery_00562", "q": "A patient complains that his patellae dislocate whenever the knees are flexed and spontaneously relocate with extension. What is this condition?", "options": ["pathological dislocation", "stress dislocation", "traumatic dislocation", "habitual dislocation"], "correct": 3, "difficulty": 2},
{"id": "surgery_00563", "q": "Highly displaced pelvic fractures are associated with high mortality due to", "options": ["high rate of infection and sepsis", "bleeding from the venous pelvic and sacral plexus", "bleeding from a major arterial injury", "associated bladder injury"], "correct": 1, "difficulty": 2},
{"id": "surgery_00564", "q": "Which is the most appropriate X-ray request for a lumbar spine trauma?", "options": ["AP and Lateral views from the first till the fifth lumbar vertebrae", "AP and Lateral views from the twelfth dorsal till the fifth lumbar vertebrae", "AP and Lateral views from the first lumbar till the first sacral vertebrae", "AP and Lateral views from the twelfth dorsal till the first sacral vertebrae"], "correct": 3, "difficulty": 1},
{"id": "surgery_00565", "q": "The reduction was not perfect after a closed reduction of a six-year-old child’s greenstick fracture of the forearm. However, the surgeon accepted it. Which is the phenomenon that the surgeon referenced in his decision?", "options": ["low demand needs in children", "low function problem this malunion will cause", "high remodelling power in children", "high adaptation power in children"], "correct": 2, "difficulty": 2},
{"id": "surgery_00566", "q": "Which of the following is a significant drawback of using the plaster of Paris to fix a distal radius fracture in an elderly female?", "options": ["charcot arthropathy", "myositis ossification", "Sudek’s atrophy", "nonunion"], "correct": 2, "difficulty": 2},
{"id": "surgery_00567", "q": "Avascular necrosis following improperly treated neck of femur", "options": ["leads to nonunion of the fracture", "leads to structural collapse of the head", "leads to primary osteoarthritis of the hip joint", "leads to secondary osteomyelitis of the neck of the femur"], "correct": 1, "difficulty": 2},
{"id": "surgery_00568", "q": "A four-year-old boy sustains a Salter-Harris type four injury of his distal radius. The parents are concerned about the potential complications. What is the most common complication?", "options": ["infection", "angular deformity", "non-union", "avascular necrosis"], "correct": 1, "difficulty": 2},
{"id": "surgery_00569", "q": "A twelve-year-old boy acquired a twisting injury to his knee. The distal femur accidentally discovered a bony lesion (non-ossifying fibroma) during the radiologic evaluation. There is no history of preceding pain or tenderness on clinical examination. What is your management?", "options": ["observation with follow-up", "curettage", "wide resection", "chemotherapy"], "correct": 0, "difficulty": 2},
{"id": "surgery_00570", "q": "Which of the following is highly suspicious for a pathologic fracture?", "options": ["crepitus at the fracture site", "high-energy trauma", "preceding pain", "massive oedema and swelling"], "correct": 2, "difficulty": 1},
{"id": "surgery_00571", "q": "Which biopsy modalities are not preferred for bone tumour diagnosis?", "options": ["open surgical incisional biopsy", "open surgical excisional biopsy", "CT-guided core tissue biopsy", "fine needle aspiration cytology"], "correct": 3, "difficulty": 2},
{"id": "surgery_00572", "q": "Which of the following is the hormonal profile of a middle-aged female suffering from osteoma lacia?", "options": ["low parathyroid level and normal thyroid hormone levels", "high parathyroid and normal thyroid hormone levels", "normal parathyroid and high thyroid hormone levels", "normal parathyroid and low thyroid hormone levels"], "correct": 1, "difficulty": 2},
{"id": "surgery_00573", "q": "Which of the following is correct regarding osteoarthritis (OA)", "options": ["an entire disease of the elderly", "an entire a disease of the big weight-bearing joints", "a chronic disease with no acute flares", "is never associated with systemic manifestations"], "correct": 2, "difficulty": 1},
{"id": "surgery_00574", "q": "Which of the following in the primary pathological feature of osteoarthritis?", "options": ["subchondral bone sclerosis", "margins osteophyte formation", "loss of hyaline cartilage thickness", "synovial irritation and effusion"], "correct": 2, "difficulty": 1},
{"id": "surgery_00575", "q": "A 75-year-old lady complains of progressive kyphosis, shortening, and back pain. She gave a history of uncontrolled diabetes and hypertension. Her radiographs showed multiple diminished vertebral bone height. What investigation is needed to detect the cause?", "options": ["99m technetium radionuclide bone scan", "dual Energy X-ray Absorptiometry", "magnetic resonance imaging", "computed tomography"], "correct": 1, "difficulty": 2},
{"id": "surgery_00576", "q": "Which of the following plays a very important risk factor for acute hematogenous osteomyelitis in children?", "options": ["vascular stasis", "anti-oedematous drugs", "high caloric intake", "hyper lax joints"], "correct": 0, "difficulty": 1},
{"id": "surgery_00577", "q": "Which of the following isolates the bacteria case of peri-implant infection?", "options": ["bacterial cilia", "bacterial ribosomes", "bacterial protein polysaccharide biofilm", "bacterial centromere"], "correct": 2, "difficulty": 1},
{"id": "surgery_00578", "q": "The most probable diagnosis of a hand feverish newborn with a nearly paralyzed lower limh in an incubator is", "options": ["hereditary diaphyseal Aclasis", "Septic hip joint", "developmental dysplasia of the hip", "congenital coxa vara"], "correct": 1, "difficulty": 2},
{"id": "surgery_00579", "q": "The action of restoration of the perfect anatomical relationship between the fracture fragments is indicated in", "options": ["Comminuted midshaft fracture of the femur", "Green stick midshaft fracture of the humerus", "Pathological fracture of the proximal femur", "Fracture of the acetabulum"], "correct": 3, "difficulty": 2},
{"id": "surgery_00580", "q": "The process of bone remodelling during the fracture healing", "options": ["Reshaping the bone to fit its original shape and function", "Endochondral ossification that transforms the soft callus into hard bone", "Formation of an immature and disorganized fibro-osteo-cartilaginous tissue", "Inflammatory reaction with the proliferation of stem cells under the periosteum"], "correct": 0, "difficulty": 1},
{"id": "surgery_00581", "q": "During aggressive training, a professional football player complained of bilateral mid-leg pains. Magnetic resonance imaging revealed bilateral midshafts incomplete tibial fractures. What is the type of these fractures?", "options": ["Insufficiency fracture", "Stress fracture", "Pathological fracture", "Traumatic fracture"], "correct": 1, "difficulty": 2},
{"id": "surgery_00582", "q": "The patient complained of severe pain and foot paraesthesia after open reduction and internal fixations of high-energy fractures of the midshaft tibia and fibula. The physician reported severe swelling with intolerable pain with toes dorsiflexion. What is the treatment?", "options": ["Enhance the pain control", "Leg elevation and reassurance", "Add aggressive antibiotic drugs", "Immediate fasciotomy"], "correct": 3, "difficulty": 3},
{"id": "surgery_00583", "q": "Anatomical reduction and rigid fixation using plate and screws of fractures ulna and radius will lead to which type of healing?", "options": ["Direct", "Indirect", "Callus", "Absolute"], "correct": 0, "difficulty": 1},
{"id": "surgery_00584", "q": "Which of the following represents the correct order of bone healing after anatomical reduction and rigid fixation by plate and screws after midshaft fracture humerus?", "options": ["Hematoma and inflammation then the direct osteonal remodeling", "Hematoma and inflammation, soft callus, consolidation, and remodeling", "Hematoma and inflammation, consolidation, remodeling, and callus formation", "Hematoma and inflammation, soft callus, hard callus, and finally consolidation"], "correct": 0, "difficulty": 1},
{"id": "surgery_00585", "q": "Which of the following is the appropriate primary wound management of an open fracture in the emergency room?", "options": ["Antibiotics administration and keeping the whole wound management in the operation theatre", "Wound exposure, copious lavage, debridement, then primary sutures together with antibiotics administration", "Wound exposure, copious lavage, debridement, then wound approximation sutures together with antibiotics administration", "Wound verification, gross debris removal, copious lavage, then sterile dressing cover together with antibiotics administration"], "correct": 3, "difficulty": 3},
{"id": "surgery_00586", "q": "Which of the following is an early local complication of a fracture of the midshaft of the humerus?", "options": ["Loss of sensation over the lateral aspect of the shoulder and shoulder abduction", "Loss of thumb adduction together with the abduction of other fingers", "Loss of the wrist and fingers flexion and elbow pronation", "Loss of wrist and fingers extension"], "correct": 3, "difficulty": 2},
{"id": "surgery_00587", "q": "The ideal management for open fracture includes", "options": ["Early wound coverage and early internal fixation of the fracture", "Late wound coverage and late internal fixation of the fracture", "Early wound coverage and early external fixation of the fracture", "Late wound coverage and late external fixation of the fracture"], "correct": 2, "difficulty": 2},
{"id": "surgery_00588", "q": "Concerning post-traumatic myositis ossification", "options": ["Always lead to joint ankylosis", "Neoplastic metaplasia of the surrounding muscles", "Commonly seen around the hip, shoulder and elbow", "Loss of wrist and fingers extension"], "correct": 2, "difficulty": 1},
{"id": "surgery_00589", "q": "Concerning avascular necrosis following fracture neck of femur", "options": ["Leads to nonunion of the fracture", "Leads to structural collapse of the head", "Leads to primary osteoarthritis of the hip joint", "Leads to early infection and secondary osteomyelitis"], "correct": 1, "difficulty": 2},
{"id": "surgery_00590", "q": "The most common primary carcinoma that gives rise to bone metastasis is:", "options": ["Breast", "Colo-rectal", "Pancreas", "Melanoma"], "correct": 0, "difficulty": 1},
{"id": "surgery_00591", "q": "Which of the following is not a cardinal pathological feature of osteoarthritis", "options": ["Progressive loss of hyaline cartilage", "Subchondral osteopenia", "Marginal bone and cartilage overgrowth", "Capsular fibrosis and thickening"], "correct": 1, "difficulty": 1},
{"id": "surgery_00592", "q": "A five-year-old boy presented with knees bowing. Clinical examination revealed a broadening of his wrists, ankles and costochondral junctions. Which laboratory blood findings belong to him?", "options": ["Low PTH, alkaline phosphatase and serum calcium levels", "High PTH with low alkaline phosphatase and serum calcium levels", "Low serum alkaline phosphatase and calcium with high PTH levels", "High PTH and alkaline phosphatase levels with low serum calcium"], "correct": 3, "difficulty": 2},
{"id": "surgery_00593", "q": "Which statement defines osteomalacia and osteoporosis?", "options": ["Osteomalacia and osteoporosis are defective bone mineralization at different ages", "Osteomalacia and osteoporosis are defective bone density at different ages", "Osteomalacia is defective bone mineralization, while osteoporosis is defective bone density", "Osteoporosis is defective bone mineralization, while osteomalacia is defective bone density"], "correct": 2, "difficulty": 1},
{"id": "surgery_00594", "q": "Sequestrum is defined as which of the following?", "options": ["Reactive bone in acute osteomyelitis", "Reactive bone in chronic osteomyelitis", "Necrotic bone providing an infection nidus in chronic osteomyelitis", "Healthy bone adjacent to chronic osteomyelitis"], "correct": 2, "difficulty": 1},
{"id": "surgery_00595", "q": "A Premature newborn in the neonatal ICU reported a recent fever and limited left hip movement. ESR is 112, CRP 67, WBCs are 21,000cells/μl of serum, and the nurses had trouble changing the diapers. Which is the essential step in management?", "options": ["Board spectrum antibiotics and fluids", "Immediate joint aspiration and culture", "Open surgical drainage", "Ultrasound-guided aspiration"], "correct": 2, "difficulty": 3},
{"id": "surgery_00596", "q": "The characteristic feature that differentiates the acute from the chronic implant-related bone infection is the development of", "options": ["Skin sinus", "Pus", "Biofilm", "Implant loosening"], "correct": 2, "difficulty": 2},
{"id": "surgery_00597", "q": "What is the treatment of choice of idiopathic congenital club foot in a newborn?", "options": ["Observation and reassessment at the age of one year", "Serial casting", "Surgical soft tissue release", "Surgical corrective osteotomy"], "correct": 1, "difficulty": 1},
{"id": "surgery_00598", "q": "Hallux valgus deformity is:", "options": ["Outward deviation of the big toe at tarsometatarsal joints", "Inward deviation of the big toe at tarsometatarsal joints", "Inward deviation of the big toe at the metatarsophalangeal joint", "Outward deviation of the big toe at the metatarsophalangeal toe"], "correct": 3, "difficulty": 1},
{"id": "surgery_00599", "q": "The physiological development of the lower limb alignment", "options": ["valgum is common at birth and recovers by 2-3 years", "varum is common at 2-3 years and recovers by 6-7 years", "varum is common at birth and recovers by 2-3 years", "it is always neutral, and any deviation is pathological"], "correct": 2, "difficulty": 1},
{"id": "surgery_00600", "q": "Which of the following is a radiographic finding of developmental dysplasia of the hip?", "options": ["Intact Shenton line", "Shallow acetabulum", "Slipped upper femoral head epiphysis", "Flat femoral head epiphysis"], "correct": 1, "difficulty": 1},
{"id": "surgery_00601", "q": "Which orthopaedic trauma situation would comparison X-ray views with the normal side be rec ommended for the decision-making?", "options": ["Shoulder dislocation in a twenty-years-old male", "Displaced fracture neck of the fracture in a 70-year-old male", "Physeal injury around the elbow in a child four-years-old", "Midshaft fracture of the humerus in a child ten-years-old"], "correct": 2, "difficulty": 1},
{"id": "surgery_00602", "q": "Technetium-99m radionuclide bone scan", "options": ["Diagnostic imaging of choice for osteoporosis", "Highly specific to bone tumors", "Hot spot indicates increased osteoblastic activity", "Implies measurement of the concentration of a biologically fludeoxyglucose"], "correct": 2, "difficulty": 1},
{"id": "surgery_00603", "q": "The sequence of musculoskeletal examination", "options": ["Look, active then passive move, feel and special test", "Look, feel, active then passive move and special test", "Look, passive then active move, feel and special test", "look feel passive then active move and special test"], "correct": 1, "difficulty": 1},
{"id": "surgery_00604", "q": "DXA scan is the used for evaluation of:", "options": ["Osteoporosis", "Osteomalacia", "Osteomyelitis", "Osteosarcoma"], "correct": 0, "difficulty": 1},
{"id": "surgery_00605", "q": "The process of bone consolidation during the fracture healing", "options": ["Reshaping the bone to fit its original shape and function", "Endochondral ossification that transforms the soft callus into hard bone", "Formation of an immature and disorganized fibro-osteo-cartilaginous tissue", "Inflammatory reaction with the proliferation of stem cells under the periosteum"], "correct": 1, "difficulty": 1},
{"id": "surgery_00606", "q": "Which is the treatment for displaced ipsilateral medial and lateral malleoli fractures?", "options": ["Closed reduction and cast application", "Closed reduction and functional brace", "Anatomical reduction and rigid internal fixation", "Functional reduction and rigid internal fixation"], "correct": 2, "difficulty": 2},
{"id": "surgery_00607", "q": "A 10 years-old boy presented with a midshaft tibial fracture after low-energy trauma. His moth er gives a history of several operations done in the same place over the last three years to treat osteomyelitis. What type of fracture is this?", "options": ["Insufficiency fracture", "Stress fracture", "Pathological fracture", "Traumatic fracture"], "correct": 2, "difficulty": 2},
{"id": "surgery_00608", "q": "If a patient has a history of recurrent shoulder joint dislocation and the radiographs appear nor mal, what is the investigation of choice to delineate the associated bony injuries?", "options": ["Ultrasound", "Magnetic resonance imaging", "Computed tomography", "Bone scan"], "correct": 2, "difficulty": 2},
{"id": "surgery_00609", "q": "Closed reduction of a dislocated joint is mainly achieved through which of the following ma noeuvres?", "options": ["Pushing of the limb", "Traction of the limb", "Rotation of the limb", "Bed rest and sedation"], "correct": 1, "difficulty": 1},
{"id": "surgery_00610", "q": "Physeal injuries in children require special attention. Which statement describes the most ap propriate treatment modality for it?", "options": ["Closed reduction is the goal", "Open reduction is the goal", "Functional reduction is the goal", "Anatomical reduction is the goal"], "correct": 3, "difficulty": 2},
{"id": "surgery_00611", "q": "The reduction was not perfect after a closed reduction of a greenstick fracture of the forearm in a six-year-old child. However, the surgeon accepted it. Which is the phenomenon that the sur geon referenced in his decision?", "options": ["Low demand and functional needs in children", "Low function problem this malunion will cause", "High and rapid remodeling power in children", "High and rapid consolidation power in children"], "correct": 2, "difficulty": 2},
{"id": "surgery_00612", "q": "Why do spinal column fractures occur more commonly in the cervical- dorsal and dorsal-lumbar junctions?", "options": ["Common sites for direct trauma", "Sites of stresses alternation", "Sites of blood supply alternation", "Sites of muscles attachment and strong pull"], "correct": 1, "difficulty": 1},
{"id": "surgery_00613", "q": "Which is the most appropriate X-ray request for a lumbar trauma?", "options": ["AP and Lateral views from the first till the fifth lumbar vertebrae", "AP and Lateral views from the twelfth dorsal till fifth lumbar vertebrae", "AP and Lateral views from the first lumbar till the first sacral vertebrae", "AP and Lateral views from the twelfth dorsal till first sacral vertebrae"], "correct": 3, "difficulty": 1},
{"id": "surgery_00614", "q": "Which of the following is considered a general complications fracture?", "options": ["Rhabdomyolysis", "Myositis ossificans", "Complex regional pain syndrome", "Avascular necrosis"], "correct": 0, "difficulty": 1},
{"id": "surgery_00615", "q": "Which of the following is considered a local complication of fracture?", "options": ["Rhabdomyolysis", "Myositis ossificans", "Pressure sores", "Fat embolism"], "correct": 1, "difficulty": 1},
{"id": "surgery_00616", "q": "What is the complication of a malunited intra-articular fracture of the distal femur?", "options": ["Osteoporosis", "Osteoarthritis", "Osteopetrosis", "Osteomalacia"], "correct": 1, "difficulty": 1},
{"id": "surgery_00617", "q": "Which of the following is not a complication of supracondylar fracture of the humerus in chil dren?", "options": ["Compartment syndrome", "Myositis ossificans", "Malunion", "Non-union"], "correct": 3, "difficulty": 2},
{"id": "surgery_00618", "q": "Concerning post-fracture compartment syndrome", "options": ["Diagnosis is unlikely if the distal pulse is felt", "Thigh and arm are the commonly involved", "Pain is out of proportion to the signs", "Limb swelling is a late sign"], "correct": 2, "difficulty": 2},
{"id": "surgery_00619", "q": "Concerning post-traumatic myositis ossification", "options": ["Always lead to joint ankylosis", "Neoplastic metaplasia of the surrounding muscles", "Commonly seen around the hip, shoulder and elbow", "Never occur in children"], "correct": 2, "difficulty": 1},
{"id": "surgery_00620", "q": "The most common malignant bone tumour in the elderly is:", "options": ["Osteosarcoma", "Ewing sarcoma", "Lymphoma", "Metastatic bone disease"], "correct": 3, "difficulty": 1},
{"id": "surgery_00621", "q": "Which of the following is the consequence of vitamin D deficiency in a middle aged female?", "options": ["Rickets", "Osteomalacia", "Osteoporosis", "Osteolysis"], "correct": 1, "difficulty": 1},
{"id": "surgery_00622", "q": "Concerning radiographic (X-rays) diagnosis of acute hematogenous osteomyelitis in children", "options": ["Radiographic changes, especially involucrum, are diagnostic in the early days", "Radiographic changes, especially cloacae, are diagnostic in the early days", "Radiographic changes, especially sequestrum, are diagnostic in the early days", "Radiographic changes are not reliable for early diagnosis"], "correct": 3, "difficulty": 2},
{"id": "surgery_00623", "q": "Regarding multiple hereditary exostoses", "options": ["Osteochondromas grow after skeletal maturity", "Autosomal recessive condition", "Treatment includes mainly correction of deformities", "Only affect the axial skeleton"], "correct": 2, "difficulty": 1},
{"id": "surgery_00624", "q": "Mandibular fractures can be diagnosed by:", "options": ["Plain X-ray", "Panoramic view of the mandible", "CT scan", "All of the above"], "correct": 3, "difficulty": 1},
{"id": "surgery_00625", "q": "Fifteen-year-old boy sustains non-displaced transverse fracture of scaphoid bone after he falls on his outstretched hand during a football game. The most appropriate management is immobili zation in thumb Spica cast for how many weeks?", "options": ["2 to 4.", "5 to 6", "7 to 8", "10 to 14"], "correct": 3, "difficulty": 2},
{"id": "surgery_00626", "q": "Open book pelvic fracture is commonly associated with?", "options": ["Hemodynamic instability", "Infection", "Extrusion", "Spine fracture"], "correct": 0, "difficulty": 1},
{"id": "surgery_00627", "q": "Which one of the following fractures is known to cause bone necrosis?", "options": ["Fracture of scaphoid bone.", "Fracture of the shaft of a metacarpal bone.", "Fracture of shaft of humerus.", "Fracture of inferior pubic ramus.", "Fracture of shaft of femur."], "correct": 0, "difficulty": 1},
{"id": "surgery_00628", "q": "About complications of fractures, all the following statements are true, except:", "options": ["Fracture of the shaft of humerus can cause wrist drop.", "Fracture of the medial epicondyle of humerus can cause claw hand deformity.", "Fracture of the surgical neck of humerus can cause atrophy of deltoid muscle.", "Extracapsular fracture of neck of femur can cause necrosis of its head.", "Supracondylar fracture of the femur can cause popliteal artery injury."], "correct": 3, "difficulty": 1},
{"id": "surgery_00629", "q": "Internal fixation is indicated for all the following fractures, except:", "options": ["Extracapsular fracture of neck of femur.", "Displaced ankle fractures.", "Supracondylar fracture of the femur with popliteal artery injury.", "Fracture of the shaft of femur in an adult.", "Compound fracture of the tibia."], "correct": 2, "difficulty": 2},
{"id": "surgery_00630", "q": "The least possible complication of an unstable fracture of the pelvis is?", "options": ["Severe bleeding.", "Urinary bladder injury.", "Injury of the urethra.", "Malunion that causes future obstruction of the birth canal.", "Femoral nerve injury."], "correct": 4, "difficulty": 2},
{"id": "surgery_00631", "q": "Fat embolism is most likely to follow fracture of:", "options": ["Ribs.", "Shaft of femur.", "Maxilla.", "Tarsal bones.", "Clavicle."], "correct": 1, "difficulty": 1},
{"id": "surgery_00632", "q": "About Pott’s disease of the spine, all the following statements are true except:", "options": ["This is tuberculous osteomyelitis of the Spine.", "It is a disease of childhood.", "Bones show bone destruction without new bone formation.", "A cold abscess may show as a swelling the thigh.", "Treatment is mainly surgical."], "correct": 4, "difficulty": 2},
{"id": "surgery_00633", "q": "About osteosarcoma, one statement only is true:", "options": ["The tumor is purely osteolytic.", "The tumor does not invade the neighboring soft tissues", "Hematogenous spread goes mainly to the liver.", "Pain is the main symptom.", "Alfa fetoprotein is elevated."], "correct": 3, "difficulty": 1},
{"id": "surgery_00634", "q": "About giant cell tumor of bone, which one statement is true?", "options": ["It usually arises from the shaft of a long bone.", "It affects elderly people.", "The tumor is always highly malignant.", "It does not invade the articular cartilage of the nearby joint.", "Radiologically it shows both bone destruction and new bone formation."], "correct": 3, "difficulty": 1},
{"id": "surgery_00635", "q": "Which one of the following is not a recognized feature of a Colles’ fracture?", "options": ["Ulnar styloid fracture", "Impaction", "Volar displacement", "Radial tilt", "Radial displacement."], "correct": 2, "difficulty": 1},
{"id": "surgery_00636", "q": "A 75-year-old woman is admitted following a fall at home. Her leg is shortened and externally rotated. Radiographs show a fracture line running through both the greater and the lesser tro chanters. The appropriate management is", "options": ["Traction for 8-12 weeks", "Cannulated screw fixation", "Hemiarthroplasty", "Proximal femoral nail", "Dynamic hip screw."], "correct": 4, "difficulty": 2},
{"id": "surgery_00637", "q": "Out of the following bone pathologies, which is not correctly matched to the most common site at which it occurs?", "options": ["Enchondroma - Bones of hands and feet", "Osteoma - Cranial vault and skull.", "Ewing’s sarcoma - Mid-shaft femur", "Osteosarcoma - Femur, just above the knee", "Osteomyelitis Mid-shaft long bone."], "correct": 2, "difficulty": 1},
{"id": "surgery_00638", "q": "Looser’s zones (also known as pseudo fractures) are a radiographic feature characterizing which one of the following bone diseases?", "options": ["Osteomalacia", "Osteoporosis", "Gout", "Paget’s disease", "Osteomyelitis"], "correct": 0, "difficulty": 1},
{"id": "surgery_00639", "q": "Pelvic fractures", "options": ["Are harmless fractures and only need bed rest", "Are never associated with neurological injuries", "Are not associated with a large blood loss", "Can be associated with other extremity injuries"], "correct": 3, "difficulty": 1},
{"id": "surgery_00640", "q": "What is not True of acute pyogenic osteomyelitis:", "options": ["Trauma is a predisposing factor.", "Common infecting agent is Staph. Aureus.", "Infection is usually blood borne.", "All are true"], "correct": 3, "difficulty": 1},
{"id": "surgery_00641", "q": "In Pott’s spine, the disease starts in the:", "options": ["Intervertebral disk.", "Anterior vertebral margin.", "Posterior vertebral margin.", "Paravertebral soft tissue"], "correct": 1, "difficulty": 1},
{"id": "surgery_00642", "q": "Sun ray appearance of osteosarcoma is because of:", "options": ["Periosteal reaction.", "Osteonecrosis.", "Calcification along vessels.", "None of the above."], "correct": 0, "difficulty": 1},
{"id": "surgery_00643", "q": "Bone metastasis in male commonly arises from cancer of:", "options": ["Lung.", "Prostate.", "Kidney.", "Thyroid."], "correct": 1, "difficulty": 1},
{"id": "surgery_00644", "q": "A greenstick fracture:", "options": ["Occurs chiefly in the elderly.", "Does not occur in children.", "Is a spiral fracture of tubular bone.", "Is a fracture where part of the cortex is intact and part is crumpled or cracked."], "correct": 3, "difficulty": 1},
{"id": "surgery_00645", "q": "The single most important factor in fracture healing is:", "options": ["Correct bone alignment.", "Accurate reduction.", "Immobilization.", "Organization of clot."], "correct": 2, "difficulty": 1},
{"id": "surgery_00646", "q": "Anterior dislocation of shoulder may be complicated by:", "options": ["Brachial plexus injury.", "Tear of rotator cuff.", "Fracture head of humerus.", "All of the above."], "correct": 3, "difficulty": 1},
{"id": "surgery_00647", "q": "What is not True about fracture surgical neck of humerus:", "options": ["Occurs due to fall on outstretched hand.", "Common to children.", "Osteoporosis is an important risk factor.", "Non-union is uncommon."], "correct": 1, "difficulty": 1},
{"id": "surgery_00648", "q": "Fractures can be treated by all of the following modalities:", "options": ["Conservative treatment with cast or slaps", "Open reduction and internal fixation", "Closed reduction and external fixation", "All of the above"], "correct": 3, "difficulty": 1},
{"id": "surgery_00649", "q": "Which of the following statements regarding carpal tunnel syndrome is correct?", "options": ["It is always associated with pregnancy and diabetes", "It is due to compression of the median nerve.", "involves compression of the ulnar nerve in the carpal tunnel", "Surgical treatment involves release of the plantar fascia"], "correct": 1, "difficulty": 1},
{"id": "surgery_00650", "q": "Open reduction of and internal fixation of fractures", "options": ["Is not associated with periosteal stripping or postoperative infection", "Is never associated with heterotopic ossification", "Can be achieved by plates and screws or intramedullary nails", "Always requires longer periods of immobilization"], "correct": 2, "difficulty": 1},
{"id": "surgery_00651", "q": "The most common cause of pathological fractures in elderly patients", "options": ["Osteopetrosis", "Osteomyelitis", "Osteosarcoma", "Bone metastasis"], "correct": 3, "difficulty": 1},
{"id": "surgery_00652", "q": "Supracondylar fractures of the femur in ADULTS are:", "options": ["Always treated by conservatively", "Always associated with neuro-vascular injuries", "Osteoporosis is never associated with this type of fracture", "None of the above."], "correct": 3, "difficulty": 2},
{"id": "surgery_00653", "q": "Primary osteosarcoma of the femur", "options": ["Usually occurs in very young children", "Is treated only by radiotherapy", "Does need advanced diagnostic tools as MRI of the femur and chest CT to establish the treat ment plan", "Amputation of the affected limb is never a treatment modality"], "correct": 2, "difficulty": 2},
{"id": "surgery_00654", "q": "The treatment of Intracapsular fractures of the neck of femur in elderly patients", "options": ["Can be treated by skin traction", "is best treated by total hip replacement or hemiarthroplasty.", "The incidence of malunion is very high if internally fixed", "If reduced and fixed internally avascular necrosis will never occur."], "correct": 1, "difficulty": 2},
{"id": "surgery_00655", "q": "Whilst playing football, a middle-aged patient heard a sudden pop sound from the right knee with severe pain. He couldn’t extend his knee. On examination there was an extension lag, how ever, you can extent the knee passively. There was tenderness just above the patella, a defect was felt. This is most likely due to injury of the following structure?", "options": ["Fracture patella", "Avulsion of the tibial tuberosity", "Quadriceps tendon rupture", "Patella tendon rupture"], "correct": 2, "difficulty": 2},
{"id": "surgery_00656", "q": "A 6-year-old boy sustained a fracture at the upper end of the humerus that has healed. He is unable to abduct his shoulder and has a numb area in the lateral aspect of the shoulder. Which of the following structures was most likely damaged?", "options": ["Median nerve", "Axillary nerve", "Ulnar nerve", "Radial nerve"], "correct": 1, "difficulty": 2},
{"id": "surgery_00657", "q": "Meniscal tears in the knee can be treated by", "options": ["Arthroscopic repair", "Partial meniscectomy", "Conservative treatment", "All of the above"], "correct": 3, "difficulty": 1},
{"id": "surgery_00658", "q": "A 5-year-old boy sustains a supracondylar fracture of the right femur after falling from a height of 2 meters. Which of the following complications might occur in this fracture?", "options": ["Popliteal artery injury", "Femoral nerve injury", "Saphenous nerve injury", "Quadriceps tendon injury"], "correct": 0, "difficulty": 1},
{"id": "surgery_00659", "q": "The following is true about bone tumors:", "options": ["Adamantinoma is a very common malignant bone tumour.", "Secondary malignant spread to bone constitutes the most common malignant bone tumor", "Benign bone tumors never turn into malignant tumors", "Pathological fractures are rare in bone tumors"], "correct": 1, "difficulty": 1},
{"id": "surgery_00660", "q": "Regarding bone infection which statement is correct?", "options": ["Acute bone infection is not curable", "Bone infection is never caused by bacteremia", "Only occurs in children,", "Might occur after open fractures"], "correct": 3, "difficulty": 1},
{"id": "surgery_00661", "q": "Regarding fractures of the spine", "options": ["Quadriplegia occurs at fractures at the level of D6 in the dorsal spine", "Always are treated by surgery", "Is always accompanied by urine incontinence", "None of the above"], "correct": 3, "difficulty": 2},
{"id": "surgery_00662", "q": "Fracture neck femur in the elderly is associated with:", "options": ["Vascular injury", "Low energy trauma sustained by the elderly patient", "Sciatic nerve injury", "Pelvic veins injury"], "correct": 1, "difficulty": 1},
{"id": "surgery_00663", "q": "The blood supply of the head of the femur mainly depends on the", "options": ["Posterior tibial Artery", "Internal iliac artery", "Extracapsular ring located on the base of the neck of the femur", "Epigastric artery"], "correct": 2, "difficulty": 1},
{"id": "surgery_00664", "q": "Trochanteric fractures in the elderly", "options": ["Are not associated often with osteoporosis", "Are treated by open or closed reduction and internal fixation", "Are associated with a higher incidence of avascular necrosis of the femoral head if comparted with intracapsular fractures of the neck of the femur.", "Can be treated by a hip spica."], "correct": 1, "difficulty": 2},
{"id": "surgery_00665", "q": "Femoral shaft fractures in the young adults", "options": ["Road traffic accidents very rarely results in femoral fractures in young adults", "Might be associated with other concomitant fractures as pelvis or tibial fractures.", "Are best treated by traction in the young adults.", "Unite completely in 6 weeks"], "correct": 1, "difficulty": 1},
{"id": "surgery_00666", "q": "Regarding meniscal tears:", "options": ["They are best diagnosed by clinical examination and MRI of the affected knee", "They never need surgery", "In certain indications arthroscopic surgery is performed", "Answer a and c are correct."], "correct": 3, "difficulty": 1},
{"id": "surgery_00667", "q": "Regarding cruciate ligament tears", "options": ["Posterior cruciate ligament (PCL) tears are more common than anterior cruciate ligament (ACL) tears.", "The patients suffering from ACL do not have any clinical symptoms or complains.", "ACL tear might be associated with a pop sensation occurring at the time of trauma and giving way later", "After arthroscopic reconstruction of the ACL, physiotherapy is not important."], "correct": 2, "difficulty": 1},
{"id": "surgery_00668", "q": "Regarding Fractures of the tibia in the adult", "options": ["Are always closed fractures", "Are always associated with fibular fractures", "Could be stabilized preliminary with an external fixator when the tibial fracture is open (compound).", "Compartment syndrome is not associated tibial fractures"], "correct": 2, "difficulty": 1},
{"id": "surgery_00669", "q": "Which statement regarding metaphyseal aclasia (Hereditary multiple exostoses) is correct:", "options": ["Nerve compression of nearby nerves never occurs", "It never turns malignant", "Each exostosis is covered by a cartilaginous cup.", "It is not inherited"], "correct": 2, "difficulty": 1},
{"id": "surgery_00670", "q": "An 11-year-old girl presents with her concerned mother in your office. The child describes a painful swelling with obvious dilated veins around the right distal femur for one week. Pain started before swelling, however there is no limitation of movement of the right knee and the patient denies any trauma in the last few weeks. Which of the following is involved in the diagnostic work-up for this child?", "options": ["MRI of the right distal femur and knee.", "Plain x-ray of the knee and distal femur in two planes.", "Labs in the form of Blood picture, CRP and ESR.", "All of the above."], "correct": 3, "difficulty": 3},
{"id": "surgery_00671", "q": "A patient is unable to actively dorsiflex his wrist or extend his fingers following a fracture. Where is the bony injury?", "options": ["Carpal bones.", "Distal radius.", "Humerus", "Metacarpals"], "correct": 2, "difficulty": 2},
{"id": "surgery_00672", "q": "in acute osteomyelitis, the following is true:", "options": ["common at children under 10 years old", "E.coli is the most common organism", "hematogenous causes present less than 10% of cases", "high doses of antibiotics are rarely effective"], "correct": 0, "difficulty": 1},
{"id": "surgery_00673", "q": "during the initial operative management of an open fracture, the most important step is:", "options": ["application of external fixator", "wound closure", "wound irrigation and debridement", "packing of all bone fragments"], "correct": 2, "difficulty": 2},
{"id": "surgery_00674", "q": "During fracture healing of a long bone, the following is the most import for wound healing:", "options": ["Pain relieve", "Thigh drill in case of fracture femur", "intravenous antibiotics", "Rigid immobilization"], "correct": 3, "difficulty": 1},
{"id": "surgery_00675", "q": "in supracondylar fracture of humerus in children, one of the following is false:", "options": ["Volkmann’s ischemic contracture may follow", "myositis ossificans", "radial nerve palsy", "treated by lateral traction"], "correct": 1, "difficulty": 2},
{"id": "surgery_00676", "q": "regarding amputation, one of the following is FALSE:", "options": ["skin complications include adherent scar", "gas gangrene is more common in above knee amputation", "causalgia is due to abnormal sensitivity of torn somatic nerved", "A bone projection ma requires further proximal amputation"], "correct": 1, "difficulty": 1},
{"id": "surgery_00677", "q": "regarding spine fracture:", "options": ["it is only traumatic", "unstable fracture is characterized by intact posterior ligament", "spinal cord ends at the level of L3", "in cord concussion recovery is the rule"], "correct": 3, "difficulty": 1},
{"id": "surgery_00678", "q": "in pott’s disease of the spine:", "options": ["old age is more affected", "delayed paraplegia never occurred", "delayed onset paraplegia recovers in 80% of cases", "surgical decompression may not result in neurological improvement"], "correct": 2, "difficulty": 1},
{"id": "surgery_00679", "q": "Generally speaking, open reduction of fractures:", "options": ["Decreases trauma to the fracture site", "Is not associated with postoperative infection", "Can he achieved by plates and screws", "Always requires longer periods of immobilization"], "correct": 2, "difficulty": 1},
{"id": "surgery_00680", "q": "A 12-year-old boy is brought to your office 2 days after a fracture of the humerus at junction of the middle and distal third. The patient complains that he is unable to extend the wrist. Which of the following structures was most likely damaged?", "options": ["Median nerve", "Ulnar nerve", "Radial nerve", "Axillary nerve"], "correct": 2, "difficulty": 2},
{"id": "surgery_00681", "q": "A 5-year-old boy sustains a supracondylar fracture of the left humerus after fulling on the out stretched Left arm. Which of the following complications might occur in this fracture?", "options": ["Axillary nerve palsy", "Compartment syndrome of the left arm", "Vascular injury in left cubital fossa", "b and c are correct"], "correct": 3, "difficulty": 2},
{"id": "surgery_00682", "q": "The following is true about bone tumors:", "options": ["primary malignant bone tumors arc very common", "secondary malignant spread to bone constitutes the most common malignant bone tumor", "primary malignant bone tumors always behave like benign bone tumors", "neurological complications are not known to occur in bone tumors"], "correct": 1, "difficulty": 1},
{"id": "surgery_00683", "q": "infection of Bone", "options": ["can always be treated by antibiotics only", "can be fatal if not properly treated", "never occurs in children", "always occurs after open fractures"], "correct": 1, "difficulty": 1},
{"id": "surgery_00684", "q": "regarding fractures of the spine:", "options": ["Affected patients always have neurological deficits", "Can always he treated without surgery", "The x-ray findings of the fractures always directly correlate with the neurological deficit", "None of the above"], "correct": 3, "difficulty": 2},
{"id": "surgery_00685", "q": "Pelvic fractures", "options": ["Can potentially be fatal", "Can be associated with a large blood loss", "Can he associated with other extremities injuries", "All the above"], "correct": 3, "difficulty": 1},
{"id": "surgery_00686", "q": "fracture neck femur in the elderly is known for:", "options": ["Its special blood supply", "is always associated with an infection", "HIP replacement is never indicated in this fracture type", "After treatment all these patients will remain bedridden"], "correct": 0, "difficulty": 1},
{"id": "surgery_00687", "q": "Regarding traumatic hip joint dislocation", "options": ["It is never associated with fractures of the acetabulum or head of the femur.", "It always dislocates in an anterior direction.", "It is never painful.", "it occurs most often in a posterior direction."], "correct": 3, "difficulty": 1},
{"id": "surgery_00688", "q": "The treatment of intracapsular fractures of the neck of femur", "options": ["Is always conservative", "Can involve closed reduction and internal Fixation in certain situations", "Can involve a total or hemiarthroplasty", "b and c are correct."], "correct": 3, "difficulty": 2},
{"id": "surgery_00689", "q": "Femoral shaft fractures in the young adult", "options": ["Are the result of minor trauma.", "Are not associated with other concomitant fractures as pelvis or tibial fractures.", "Are the result of severe trauma.", "Are treated only by traction."], "correct": 2, "difficulty": 1},
{"id": "surgery_00690", "q": "Regarding meniscal tears:", "options": ["They are best diagnosed by x-rays", "They always need open surgery", "in certain indications arthroscopic surgery is performed", "MRI of the knee has no role in diagnosis of meniscal tears."], "correct": 2, "difficulty": 1},
{"id": "surgery_00691", "q": "Fractures of the tibia", "options": ["Can be treated by cast", "Are always open fractures", "is treated preliminary with an external fixator when the tibial fracture is open (compound).", "b and c are correct."], "correct": 2, "difficulty": 2},
{"id": "surgery_00692", "q": "A 79year-old female presents with severe backache to your office. She says that when she lies down the lumbar pain decreases markedly but walking especially for long distances increase the lower back pain. Neurological examination reveals no abnormality, however, there is direct tenderness when percussion over the spinous process of L3 is done. Which of the following is FALSE?", "options": ["Bisphosphonates are used in the treatment of this disease.", "this disease is associated with an increased risk of hip and distal radius fractures.", "An x-ray of the lumbar spine in two planes would be the new diagnostic step.", "DEXA scan has no rule in the diagnosis of this disease."], "correct": 3, "difficulty": 3},
{"id": "surgery_00693", "q": "A patient present with acute posttraumatic wrist drop. Where do you expect the bony injury?", "options": ["At the ipsilateral distal femur.", "At the ipsilateral proximal tibia.", "At the ipsilateral metacarpal bones", "At the mid shaft of the ipsilateral humans."], "correct": 3, "difficulty": 2},
{"id": "surgery_00694", "q": "Common peroneal nerve injury occurs", "options": ["Proximal femur", "Intertrochanteric area of the femur", "At the fibular head", "Isolate fracture of the pubic ramus"], "correct": 2, "difficulty": 1},
{"id": "surgery_00695", "q": "The following statements regarding fracture healing are true EXCEPT:", "options": ["Position of the fracture fragments is very important", "Vascularity of the fracture is very important.", "Generally, older patients show always baler bony healing than small children.", "Proper immobilization and fixation are very important."], "correct": 2, "difficulty": 1},
{"id": "surgery_00696", "q": "Fractures whether treated operatively or conservatively may show the following complications:", "options": ["Nerve injury due to acute injury or entrapment during the healing of bone", "visceral injuries", "Vascular injuries", "the development of osteosarcoma"], "correct": 0, "difficulty": 1},
{"id": "surgery_00697", "q": "in supracondylar fracture of humerus in children, one of the following is false:", "options": ["Volkmann’s ischemic contracture may follow", "myositis ossificans", "radial nerve palsy", "treated by lateral traction"], "correct": 1, "difficulty": 2},
{"id": "surgery_00698", "q": "regarding spine fracture:", "options": ["it is only traumatic", "unstable fracture is characterized by intact posterior ligament", "spinal cord ends at the level of L3", "in cord concussion recovery is the rule"], "correct": 3, "difficulty": 1},
{"id": "surgery_00699", "q": "in pott’s disease of the spine:", "options": ["old age is more affected", "delayed paraplegia never occurred", "early onset paraplegia recovers in 80% of cases", "surgical decompression is not indicated"], "correct": 2, "difficulty": 1},
{"id": "surgery_00700", "q": "blood loss may be up to 2.5 liters in this injury:", "options": ["fracture pelvis", "fracture shaft humerus", "supracondylar fracture femur", "hip dislocation"], "correct": 0, "difficulty": 1},
{"id": "surgery_00701", "q": "The ends of the fracture are sclerosed in this type of complication:", "options": ["Malunion", "Delayed union", "Non union", "Sudek’s atrophy"], "correct": 2, "difficulty": 1},
{"id": "surgery_00702", "q": "Which of the following tumors is liable to turn malignant?", "options": ["Osteochondroma", "Chondroma", "Osteoid osteoma", "Ivory osteoma"], "correct": 0, "difficulty": 1},
{"id": "surgery_00703", "q": "Adamantinoma is a", "options": ["chronic infection", "benign tumor", "locally malignant tumor", "malignant tumor"], "correct": 2, "difficulty": 1},

{"id": "surgery_00704", "q": "All of these are neurological emergencies EXCEPT:", "options": ["Aneurysmal Subarachnoid hemorrhage", "Extradural hemorrhage", "Intractable Epilepsy", "Brain tumor"], "correct": 3, "difficulty": 1},
{"id": "surgery_00705", "q": "Which one is FALSE?", "options": ["20% of severe head trauma is associated with cervical spine fracture", "One should care about examining the head as a first line of management of head trauma patient.", "Pupillary changes in the compressive stage of extradural hematoma are due to uncial hernia tion", "Chronic subdural hematoma is an emergency"], "correct": 3, "difficulty": 2},
{"id": "surgery_00706", "q": "Racoon eye is seen in", "options": ["Subperiosteal haematoma", "Subconjunctival hemorrhage", "Nasal bone fracture", "Fracture base of skull"], "correct": 3, "difficulty": 1},
{"id": "surgery_00707", "q": "Clinical picture of fracture of the middle cranial fossa includes all the following EXCEPT", "options": ["Battle’s sign", "CSF otorrhea", "Bleeding per ear", "Racoon sign"], "correct": 3, "difficulty": 1},
{"id": "surgery_00708", "q": "The clinical picture of increased intracranial tension includes all of the following EXCEPT", "options": ["Headache", "Vomiting", "Nausea", "6th nerve palsy"], "correct": 2, "difficulty": 1},
{"id": "surgery_00709", "q": "Spina bifida includes all of the following EXCEPT", "options": ["Meningocele", "Meningomyelocele", "Tethered cord", "Oxycephaly"], "correct": 3, "difficulty": 1},
{"id": "surgery_00710", "q": "Unequal pupils is a sign of", "options": ["Fracture base of skull", "Uncal herniation", "Intracerebral hemorrhage", "Concussion stage in extradural hematoma"], "correct": 1, "difficulty": 2},
{"id": "surgery_00711", "q": "Management of a comatosed patient with head injury begins with", "options": ["The cardiovascular system", "Pupillary reflexes", "Establishment of an airway", "Computed tomography (CT) of the brain"], "correct": 2, "difficulty": 1},
{"id": "surgery_00712", "q": "An extra-dural hematoma", "options": ["ls usually venous in origin", "Is usually accompanied by temporal skull fracture", "Should be suspected only in comatosed patients", "Can be diagnosed from a x-ray of skull"], "correct": 1, "difficulty": 1},
{"id": "surgery_00713", "q": "The most appropriate treatment of large (more than 2cm) brain abscess is", "options": ["Systemic antibiotic administration", "Injection of antibiotics into the abscess", "Aspiration and drainage of the abscess plus systemic antibiotic administration", "Marsupialization of the abscess"], "correct": 2, "difficulty": 2},
{"id": "surgery_00714", "q": "What is the most important investigation for moderate to severe head trauma?", "options": ["X-ray Skull", "CT scan", "MRI", "Blood tests"], "correct": 1, "difficulty": 1},
{"id": "surgery_00715", "q": "Which of the following pathologies is the most urgent?", "options": ["Fracture Base", "Extra-dural hemorrhage", "Subdural hemorrhage", "Intracerebral hemorrhage"], "correct": 1, "difficulty": 1},
{"id": "surgery_00716", "q": "The hematoma appears on CT scan:", "options": ["Jet black", "Hypodense", "Isodense", "Hyperdense"], "correct": 3, "difficulty": 1},
{"id": "surgery_00717", "q": "Which of the following is TRUE about lumbar disc prolapse", "options": ["Presents only with low back pain", "Straight leg raising test is positive", "Mostly occurs between L3 and L4 vertebrae", "X-ray films of the lumbosacral spine are obtained to demonstrate the presence and location of lumbar disc herniation"], "correct": 1, "difficulty": 1},
{"id": "surgery_00718", "q": "Which is FALSE regarding head injury", "options": ["A simple nondepressed linear skull fracture is treated conservatively", "Fracture base of skull is suggested with bruising around the eyes and behind the ear", "CSF rhinorrhea associated with fracture base of skull requires urgent exploration and repair of the defect.", "Prophylactic antibiotics are indicated in all basal skull fractures associated with CSF rhinorrhea or otorrhea."], "correct": 2, "difficulty": 2},
{"id": "surgery_00719", "q": "Best predictor of GCS (Glasgow Coma Score)", "options": ["Motor response", "Verbal response", "Eye opening", "All of the above"], "correct": 0, "difficulty": 1},
{"id": "surgery_00720", "q": "Which statement is FALSE regarding GCS (Glasgow Coma Score)", "options": ["The score ranges from 3 to 15", "It depends on three parameters (motor and verbal response and eye opening)", "It is used to assess conscious level", "The higher the score the worse the prognosis"], "correct": 3, "difficulty": 1},
{"id": "surgery_00721", "q": "Which is TRUE", "options": ["Neuropraxia is temporary loss of function without axonal injury", "Neurotmesis is disruption of the axon with preservation of nerve sheath", "Axonotmesis is disruption of the axon with preservation of motor and sensory function", "Regeneration of the axon is slow at a speed of 1cm/ day"], "correct": 0, "difficulty": 1},
{"id": "surgery_00722", "q": "What does the term communicating hydrocephalus mean?", "options": ["Patients are able to communicate even if they have increased intracranial pressure", "There is lesions that obstruct the subarachnoid space.", "Hydrocephalus is due to blockage at the level of the aqueduct", "None of the above"], "correct": 3, "difficulty": 1},
{"id": "surgery_00723", "q": "Which answer best describes the route of flow of CSF", "options": ["Lateral ventricles, foramina of Magendie and Luschka, subarachnoid spaces.", "Lateral ventricles, subarachnoid spaces, foramina of Magendie and Luschka", "Cisterna magna, lateral ventricles, subarachnoid space.", "Subarachnoid space, cisterna magna, lateral ventricle"], "correct": 0, "difficulty": 1},
{"id": "surgery_00724", "q": "In traumatic brain injury, which is FALSE:", "options": ["Hypotension (systolic pressure,90 mm Hg) is associated with higher mortality.", "Patients with GCS below 8 should be intubated.", "A computed tomography (CT) scan is not indicated if the patient’s Glasgow Coma Scale (GCS) score is 13 or less", "The initial resuscitation process should focus on establishing a clear airway before treating the brain injury."], "correct": 2, "difficulty": 2},
{"id": "surgery_00725", "q": "A penetrating brain injury is defined by", "options": ["Depressed skull fracture.", "Foreign object disrupting the dura.", "Increased intracranial pressure.", "A linear skull fractures"], "correct": 1, "difficulty": 1},
{"id": "surgery_00726", "q": "Clear fluid coming from the nose and ears of a patient admitted to the Emergency Department after a fall. Which type of fracture?", "options": ["Compound depressed", "Fissure", "Simple depressed", "Fracture base"], "correct": 3, "difficulty": 1},
{"id": "surgery_00727", "q": "Which is FALSE regarding simple depressed fracture", "options": ["More common in children", "Is associated with scalp wound", "Rarely associated with brain injury", "Its treatment is mainly conservative"], "correct": 3, "difficulty": 1},
{"id": "surgery_00728", "q": "Patient in the Emergency Department with a head injury received in a motor car accident. On admission, the patient’s Glasgow Coma Scale (GCS) is 14. Within 20 minutes of arrival, the GCS is 10. Which of the following is the most appropriate next step in the management?", "options": ["Lower head of the bed", "Intubate patient", "Order CT brain", "Order IV fluids"], "correct": 2, "difficulty": 3},
{"id": "surgery_00729", "q": "Regarding head trauma, which of the following is INCORRECT?", "options": ["Large extradural hemorrhage is managed surgically", "Subdural hematomas usually develop due to a skull fracture overlying the middle meningeal artery", "Subperiosteal hematomas are limited by the cranial sutures", "Simple depressed fracture of the skull vault is mostly managed conservatively"], "correct": 1, "difficulty": 2},
{"id": "surgery_00730", "q": "Source of bleeding of extradural hematoma includes all of the following EXCEPT:", "options": ["Middle meningeal artery", "Middle meningeal veins", "Dural venous sinus", "Superior cerebral veins"], "correct": 3, "difficulty": 1},
{"id": "surgery_00731", "q": "In vertebral column injury, Neurological deficit is most commonly associated with", "options": ["Fracture dislocation", "Burst fracture", "Compression Fracture", "Fracture of vertebral spinous process"], "correct": 0, "difficulty": 1},
{"id": "surgery_00732", "q": "The brain can experience secondary types of damage in head injury, it includes all EXCEPT:", "options": ["Brain edema", "Herniation (conization)", "Intracranial hemorrhage", "Contusion", "Infection"], "correct": 3, "difficulty": 1},
{"id": "surgery_00733", "q": "The pathology of Primary traumatic brain damage includes all EXCEPT", "options": ["Concussion", "Contusion", "Laceration", "infection", "Diffuse axonal injury"], "correct": 3, "difficulty": 1},
{"id": "surgery_00734", "q": "The following are measures to treat increase intracranial pressure EXCEPT", "options": ["Raise head of bed 30-45 degree", "Mannitol", "IV fluids restriction", "Lasix"], "correct": 2, "difficulty": 1},
{"id": "surgery_00735", "q": "Best prognostic factor for head injury is:", "options": ["Age", "Glasgow coma scale", "gender", "Mode of injury", "CT scan of the brain"], "correct": 1, "difficulty": 1},
{"id": "surgery_00736", "q": "Which statement is FALSE regarding scalp hematomas:", "options": ["Subgleal hematoma occupies the loose areolar connective tissue", "Subgleal hematoma is most painful", "Subpericranial hematoma is a birth injury", "Subcutaneous hematoma is small and moves with the scalp"], "correct": 1, "difficulty": 1},
{"id": "surgery_00737", "q": "All of the following are indication of hospital admission in isolated head injury EXCEPT:", "options": ["Depression of the conscious level", "Skull fractures", "Focal neurological sign", "An Attack of vomiting that occurs at time of trauma or shortly after", "Fissure fracture"], "correct": 4, "difficulty": 2},
{"id": "surgery_00738", "q": "Extra Dural Hematoma :All The Following are true Except", "options": ["May Result From Rupture Anterior Branch Of Middle Meningeal A.", "Appear As A Biconvex Shadow In CT Of The Brain.", "May Be Traumatic", "Does Not Cross The Middle Line.", "Is Due To Fracture Greater Wing Of Sphenoid"], "correct": 4, "difficulty": 1},
{"id": "surgery_00739", "q": "About Glasgow Coma Scale (GCS), all the following statements are true, except:", "options": ["It is a numerical measure of the level of consciousness.", "A rise in intra-cranial tension reduces GCS.", "GCS components are eye opening, best Verbal response and best motor response.", "GCS cannot be assessed in intubated and in sedated patients.", "The highest GCS is 12"], "correct": 4, "difficulty": 1},
{"id": "surgery_00740", "q": "Brain metastases arise most commonly from:", "options": ["Breast.", "Lung.", "Stomach.", "Kidney."], "correct": 1, "difficulty": 1},
{"id": "surgery_00741", "q": "A patient is confused and opens his eyes to painful stimuli and localizes pain has a Glasgow coma score of (GCS)?", "options": ["8.", "10.", "11.", "12."], "correct": 2, "difficulty": 2},
{"id": "surgery_00742", "q": "About extradural hematoma, all the following statements are true, except:", "options": ["It usually arises from injury of the middle meningeal artery.", "It causes progressive deterioration of conscious level.", "It causes weakness on the opposite side of the body.", "It causes pupillary dilatation with no response to light on the same side.", "It shows as a concave-convex opacity on CT scan."], "correct": 4, "difficulty": 1},
{"id": "surgery_00743", "q": "Sensory loss due to median nerve injury affects:", "options": ["The radial side of the forearm.", "The whole dorsum of the hand.", "Ulnar side of hand and wrist", "The whole palmar aspect of the hand.", "The palmar aspect of the radial side of the hand"], "correct": 4, "difficulty": 1},
{"id": "surgery_00744", "q": "Which one of the following intrinsic muscles of the hand is not innervated by the median nerve?", "options": ["First lumbrical M", "Abductor pollicis brevis", "Opponens pollicis", "Adductor pollicis", "Flexor pollicis brevis."], "correct": 3, "difficulty": 1},
{"id": "surgery_00745", "q": "Which one of the following forms the innermost layer of the scalp?", "options": ["Loose connective tissue", "Aponeurotic layer (galea)", "Skin", "Pericranium", "Dense connective tissue."], "correct": 3, "difficulty": 1},
{"id": "surgery_00746", "q": "Which of the following vessels supplying the brain is derived from the vertebral artery?", "options": ["Posterior cerebral artery", "Posterior communicating artery", "Middle cerebral artery", "Ophthalmic artery", "Anterior cerebral artery."], "correct": 0, "difficulty": 1},
{"id": "surgery_00747", "q": "In which layer does cerebrospinal fluid circulate?", "options": ["Subdural space", "Subarachnoid space", "Extradural space", "Between pia mater and spinal cord", "Spinal canal."], "correct": 1, "difficulty": 1},
{"id": "surgery_00748", "q": "Which of the following sets of clinical signs are usually associated with a basal skull fracture?", "options": ["Periorbital ecchymoses, otorrhea, retro auricular ecchymoses, cranial nerve III palsy.", "Periorbital ecchymoses, rhinorrhea, anosmia, cranial nerve VI palsy.", "Rib fracture, otorrhea, rhinorrhea, anosmia.", "Rib fracture, otorrhea, rhinorrhea, retro auricular ecchymoses.", "Periorbital ecchymoses, otorrhea, rhinorrhea, retro auricular ecchymoses."], "correct": 4, "difficulty": 1},
{"id": "surgery_00749", "q": "Cancers arising in the following organs commonly metastasize to the brain, except", "options": ["Lung", "Bowel", "Kidney", "Endometrium", "Skin."], "correct": 3, "difficulty": 1},
{"id": "surgery_00750", "q": "What is the most common malignant brain tumor in children?", "options": ["Neuroblastoma.", "Medulloblastoma..", "Ganglion neuroma.", "Astrocytoma."], "correct": 1, "difficulty": 1},
{"id": "surgery_00751", "q": "About extradural hematoma, all the following statements are true, except:", "options": ["usually arises from injury of the posterior cerebral artery.", "It causes progressive deterioration of conscious level.", "It causes weakness on the opposite side of the body.", "It causes pupillary dilatation with no response to light on the same side.", "It shows as a convex opacity on CT scan."], "correct": 0, "difficulty": 1},
{"id": "surgery_00752", "q": "What is the origin of the sympathetic nervous system?", "options": ["Thoracolumbar spinal segment", "Spinal segments S3,S4", "Cranial nerves 3,7,10", "None of the above."], "correct": 0, "difficulty": 1},
{"id": "surgery_00753", "q": "The cerebral hematoma appears on CT scan:", "options": ["Jet black", "Hypodense", "Isodense", "Hyperdense"], "correct": 3, "difficulty": 1},
{"id": "surgery_00754", "q": "Which of the following statements is FALSE?", "options": ["20% of severe head trauma is associated with cervical spine fracture.", "One should care about examining the head as a first line of management of head trauma pa tient.", "Pupillary changes in the compressive stage of extradural hematoma are due to uncal hernia tion.", "Chronic subdural hematoma is an emergency."], "correct": 3, "difficulty": 2},
{"id": "surgery_00755", "q": "The clinical picture of increased intracranial tension includes all of the following EXCEPT", "options": ["Headache", "Vomiting", "Nausea", "6th nerve palsy"], "correct": 2, "difficulty": 1},
{"id": "surgery_00756", "q": "Spina bifida includes all of the following EXCEPT", "options": ["Meningocele", "Meningomyelocele", "Tethered cord", "Oxycephaly"], "correct": 3, "difficulty": 1},
{"id": "surgery_00757", "q": "Unequal pupils is a sign of", "options": ["Fracture base of skull", "Uncal herniation", "Intracerebral hemorrhage", "Concussion stage in extradural hematoma."], "correct": 1, "difficulty": 2},
{"id": "surgery_00758", "q": "Common peroneal nerve injury is associated with:", "options": ["Tibial shaft fractures", "Femoral neck fractures", "Fibular neck fractures", "Isolated fracture of the pubic ramus"], "correct": 2, "difficulty": 1},
{"id": "surgery_00759", "q": "in cases of median nerve injury which of the following ms will be expected to be paralyzed:", "options": ["Extensor polices longus.", "Adductor polices.", "First dorsal interosseous.", "None of the above."], "correct": 3, "difficulty": 1},
{"id": "surgery_00760", "q": "Regarding Brachial plexus injuries the following is true except :", "options": ["Forcible shoulder depression might cause Erb-Duchenne palsy", "Breech presentation is at least risk of injury during vaginal delivery", "Klumpke’s palsy may result in claw hand deformity", "Surgery is indicated if conservative treatment fail to show response for two months."], "correct": 1, "difficulty": 2},
{"id": "surgery_00761", "q": "Which one of the following is present in cases of pure ulnar nerve injury", "options": ["Simian hand deformity", "Positive pointing index sign", "Positive Froment’s sign", "Paralysis of the flexor polices longus."], "correct": 2, "difficulty": 1},
{"id": "surgery_00762", "q": "Glasgow Coma scale comprises examination of all the following EXCEPT:", "options": ["Eye openings", "Motor response", "sensory level", "Verbal response"], "correct": 2, "difficulty": 1},
{"id": "surgery_00763", "q": "In extradural hematoma the artery involved is :", "options": ["posterior cerebral artery.", "Middle meningeal artery.", "Internal carotid artery.", "Anterior cerebral artery."], "correct": 1, "difficulty": 1},
{"id": "surgery_00764", "q": "Ulnar claw hand is due to paralysis of these muscle (s) :", "options": ["medial 2 lumbricals", "flexor digiti minimi", "medial half of flexor digitorum superficialis", "flexor carbi ulnaris"], "correct": 0, "difficulty": 1},
{"id": "surgery_00765", "q": "wallerian degeneration dose not occur in this type of nerve injury :", "options": ["partial neurotemesis", "complete neurotmesis", "axonotmesis", "neurapraxia"], "correct": 3, "difficulty": 1},
{"id": "surgery_00766", "q": "neuroblastoma usually arises from the", "options": ["intracrainal portion of the eighth cranial nerve", "optic chiasma", "cerebellopontine angle", "adrenal medulla"], "correct": 3, "difficulty": 1},
{"id": "surgery_00767", "q": "in cases of carpal tunnel syndrome , which of these sites is spared from symptoms ?", "options": ["the lateral half of the ring finger", "the palmer aspect of the thumb", "the thenar eminence of the palm", "the medial aspect of the index finger"], "correct": 2, "difficulty": 1},
{"id": "surgery_00768", "q": "An 18 year old patient with a history of fall on outstretched hand came to you with pain around the elbow. X-ray showed fracture of the ulna and dislocation of the superior radioulnar joint. On examination he was found to have finger drop but no wrist drop and intact distal sensation. He will probably be suffering from injury to the:", "options": ["Radial nerve trunk", "Posterior interossseus nerve", "Anterior interosseus nerve", "Extensor carpi radialis tendon"], "correct": 1, "difficulty": 2},
{"id": "surgery_00769", "q": "A 20 year old medical student came to you complaining of excess sweating from her hands that prevented her from writing. You advised her to do a cervicodorsal sympathectomy, but she asked you what are you going to do, so you told her you were going to remove these ganglia:", "options": ["Lower cervical and first thoracic", "First and second thoracic", "Second and third thoracic", "Stellate"], "correct": 2, "difficulty": 2},
{"id": "surgery_00770", "q": "Which of the following is a malignant tumor?", "options": ["Glioma", "Schwannoma", "Ganglioneuroma", "Rhabdomyoma"], "correct": 0, "difficulty": 1},
{"id": "surgery_00771", "q": "A patient with head trauma who opens his eyes only to pain, is confused and localizes pain has a Glasgow coma scale of:", "options": ["7", "9", "11", "14"], "correct": 2, "difficulty": 2},

{"id": "surgery_00772", "q": "Which is not true of cardiopulmonary resuscitation (CPR)?", "options": ["Closed chest massage is as effective as open chest massage", "The success rate for out-of-hospital resuscitation may be as high as 30% to 60%", "The most common cause of sudden death is ischemic heart disease", "Standard chest massage generally provides less than 15% of normal coronary and cerebral blood flow."], "correct": 0, "difficulty": 1},
{"id": "surgery_00773", "q": "Which maneuver generally is not performed early before chest compression in basic life support outside the hospital?", "options": ["Call for help", "Obtain airway", "Electrical cardioversion", "Ventilation"], "correct": 2, "difficulty": 1},
{"id": "surgery_00774", "q": "Tetralogy of Fallot consists of all of the following features except:", "options": ["ASD.", "VSD", "Dextroposition of the aorta", "Pulmonary stenosis and Right ventricular hypertrophy"], "correct": 0, "difficulty": 1},
{"id": "surgery_00775", "q": "In adults, the most common cause of acquired complete heart block is:", "options": ["Ischemic heart disease.", "Sclero-degenerative disease", "Traumatic injury.", "Cardiomegaly"], "correct": 1, "difficulty": 1},
{"id": "surgery_00776", "q": "The most useful incision in the operating room for patients with penetrating cardiac injury is:", "options": ["Right anterior thoracotomy", "Bilateral anterior thoracotomy", "Median sternotomy", "Subxyphoid"], "correct": 3, "difficulty": 1},
{"id": "surgery_00777", "q": "In patients who present with a penetrating chest injury, injury to the heart is most likely when the following physical sign(s) is/are present:", "options": ["Hypotension", "Distended neck veins", "Decreased heart sound", "All of the above"], "correct": 3, "difficulty": 1},
{"id": "surgery_00778", "q": "Regarding pleural effusion all of the following are true EXCEPT:", "options": ["can be tapped to make a diagnosis", "can be detected radiographically when 100ml of fluid is present", "is most commonly caused by congestive cardiac failure", "will not produce mediastinal shift even if severe"], "correct": 3, "difficulty": 1},
{"id": "surgery_00779", "q": "Cardiac contusions caused by blunt chest trauma:", "options": ["Are fairly easy to diagnose.", "Occur in up to 60% to 80% of patients with major blunt thoracic trauma", "Do not usually cause right ventricular dysfunction", "Demonstrate arrhythmia as the most common complication"], "correct": 3, "difficulty": 2},
{"id": "surgery_00780", "q": "Which of the following steps is not part of the primary survey in a trauma patient?", "options": ["Insuring adequate ventilatory support", "Measurement of blood pressure and pulse", "Neurologic evaluation with the Glasgow Coma Scale", "Examination of the cervical spine"], "correct": 2, "difficulty": 1},
{"id": "surgery_00781", "q": "Immediate life-threatening injuries that preclade air exchange which can be treated in the field include all of the following except?", "options": ["Tension pneumothorax", "Massive open chest wounds", "Sucking chest wounds", "Tracheal disruption"], "correct": 3, "difficulty": 1},
{"id": "surgery_00782", "q": "Where are the arterial baroreceptors located?", "options": ["Carotid sinus and aortic arch", "Carotid sinus only", "Superior vena cava", "None of the above"], "correct": 0, "difficulty": 1},
{"id": "surgery_00783", "q": "A 64-year-old steel worker undergoes coronary artery bypass surgery for three-vessel disease. Potoperatively he develops complete heart block. Ischaemia of the artio-ventricular node is suspected. Which branch is most likely to be the culprit vessel?", "options": ["Left anterior descending artery", "Left circumflex artery", "Posterior descending artery", "Posterior lateral artery"], "correct": 2, "difficulty": 2},
{"id": "surgery_00784", "q": "A 47-year-old woman with myasthenia gravis undergoes an open thymectomy for a suspected large thymoma displacing the heart. Immediately post-operatively the chest radiograph is abnor mal. Compared to the original radiograph the right lower zone is opacified and the right hemidia phragm is significantly elevated above the left. What is the most likely cause?", "options": ["Effusion", "Haemothorax", "Lung consolidation", "Phrenic nerve injury"], "correct": 3, "difficulty": 2},
{"id": "surgery_00785", "q": "A 19-year-old homeless man falls and suffers a single penetrating injury to the right thorax. This is through the 5th right intercostal space laterally. Chest x-ray shows a small pneumothorax, the hemidiaphragms and costo-phrenic angles are well defined. He is hypotensive despite adequate resuscitation with worsening abdominal pain in his abdomen. Ultrasound imaging reveals fluid around his liver. What is the likely cause of his symptoms?", "options": ["Diaphragmatic injury", "Empyema", "Haemothorax", "Pleural effusion"], "correct": 0, "difficulty": 3},
{"id": "surgery_00786", "q": "A 52 year old male attends for a preoperative assessment for an inguinal hernia repair. You notice that the chest x-ray shows a loculated left pleural effusion. On further questioning the patient reports that he worked as a builder 30 years ago. What is the most likely cause for the effusion?", "options": ["Asbestosis", "Pneumonia", "Mesothelioma", "Left ventricular failure"], "correct": 2, "difficulty": 2},
{"id": "surgery_00787", "q": "A 22-year-old man suffers 20% partial and full thickness burns in a house fire. There is an associated inhalational injury. It is decided to administer intravenous fluids to replace fluid losses. Which of the following intravenous fluids should be used for initial resuscitation?", "options": ["Hartmans solution", "5% Dextrose", "Dextran 40", "Blood"], "correct": 0, "difficulty": 2},
{"id": "surgery_00788", "q": "Which of the following blood products can be administered to a non-ABO matched recipient?", "options": ["Whole blood", "Platelets", "Packed red cells", "Fresh frozen plasma"], "correct": 3, "difficulty": 1},
{"id": "surgery_00789", "q": "Which drug should be administered to normalise the patients clotting prior to decannulation and chest closure as antidote to Heparin used previously?", "options": ["Intravenous vitamin K", "Protamnine sulphate", "Aprotinin", "Fresh frozen plasma"], "correct": 1, "difficulty": 1},
{"id": "surgery_00790", "q": "What is the best approach for patient with recurrent multi-loculated empyema and thick peel?", "options": ["Chest drain insertion", "Intravenous steroids", "Open thoracotomy decortication", "Oral antibiotic therapy alone"], "correct": 2, "difficulty": 2},
{"id": "surgery_00791", "q": "The most common pathological type of bronchogenic carcinoma?", "options": ["Oat cell carcinoma", "Spindle cell carcinoma", "Squamous cell carcinoma", "Tertaoma"], "correct": 2, "difficulty": 1},
{"id": "surgery_00792", "q": "Which of the following is the most appropriate landmark for the safe area of chest drain insertion?", "options": ["In the axilla", "Inferior to the nipple line", "Mid-axillary line", "Through pectoralis major"], "correct": 2, "difficulty": 1},
{"id": "surgery_00793", "q": "Which of the following is the considered the best for neonate with symptomatic isolated coarctation of the aorta?", "options": ["Endovascular stent", "Excision only", "Resection with end to end anastomosis", "PDA closure"], "correct": 2, "difficulty": 2},
{"id": "surgery_00794", "q": "All the following are indication for coronary artery bypass graft (CABG) except:", "options": ["Failed stent PTCA", "One vessel disease heavily calcified", "Stenosis of main stem left coronary artery", "Complication of infarction VSD"], "correct": 1, "difficulty": 2},
{"id": "surgery_00795", "q": "Immediate life-threatening injuries that preclude air exchange which can be treated in the field include all of the following except?", "options": ["Tension pneumothorax", "Massive open chest wounds", "Sucking chest wounds", "Tracheal disruption."], "correct": 3, "difficulty": 1},
{"id": "surgery_00796", "q": "The following statements about fractures of the ribs are true EXCEPT that they:", "options": ["May be due to direct or indirect violence.", "Never occur spontaneously.", "Causes sharp pain in the chest wall.", "May cause hemothorax, pneumothorax, or surgical emphysema.", "Are usually treated by Elastoplast strapping"], "correct": 1, "difficulty": 1},
{"id": "surgery_00797", "q": "The treatment of choice in flail chest is:", "options": ["Tracheostomy.", "Intercostal nerve block.", "Adhesive strapping.", "Elevation of broken ribs with towel clips.", "Positive pressure ventilation."], "correct": 4, "difficulty": 2},
{"id": "surgery_00798", "q": "In tension pneumothorax, the incorrect statement among the following is that", "options": ["There is a constant air leak from a tear in the lung or a valvular wound in the chest wall.", "Severe respiratory embarrassment is always present.", "Cardiac function is not affected.", "Surgical emphysema is common.", "There is displacement of the trachea and mediastinum to the opposite side."], "correct": 2, "difficulty": 1},
{"id": "surgery_00799", "q": "About chest tubes, all the following statements are true except", "options": ["To drain a haemo-pneumothorax the tube is inserted in the fifth intercostal space in mid-axillary line.", "To drain a hemothorax the tube is inserted in the second intercostal: mid-clavicular line.", "Chest tube insertion can be done under local anaethesia.", "A tube that is inserted to drain a hemothorax is removed when the lung radiologically inflated with fluid output is less than 120ml/day.", "Tube removal is a bed-side procedure that requires no anaethesia."], "correct": 1, "difficulty": 1},
{"id": "surgery_00800", "q": "About Pancoast’s tumor, all the following are true, except:", "options": ["It is the commonest form of bronchial cancer.", "The tumour is present in the apex of the lung", "It may cause Horner’s syndrome.", "It may erode the first rib."], "correct": 0, "difficulty": 1},
{"id": "surgery_00801", "q": "What is the preferred incision to access the thoracic cavity in patient with chest trauma?", "options": ["Median sternotomy.", "Posterolateral thoracotomy.", "Anterolateral thoracotomy.", "Thoracoscopy."], "correct": 2, "difficulty": 2},
{"id": "surgery_00802", "q": "Cardiac myxomas are most commonly found in:", "options": ["Left atrium.", "Right atrium.", "Left ventricle.", "Right ventricle."], "correct": 0, "difficulty": 1},
{"id": "surgery_00803", "q": "What is the most common cause of mitral stenosis?", "options": ["Congenital.", "Coronary artery disease.", "Bacterial endocarditis.", "Rheumatic heart disease."], "correct": 3, "difficulty": 1},
{"id": "surgery_00804", "q": "The risk factor for the development of coronary artery disease (CAD) is?", "options": ["Hypertension.", "Diabetes.", "Hyperlipidemia.", "All of the above."], "correct": 3, "difficulty": 1},
{"id": "surgery_00805", "q": "Intravenous access in the trauma patient A 22-year-old man is admitted following a stab injury to the right groin. He is bleeding profusely from the wound. His blood pressure is 80/40 mmHg and his pulse is 140 beats/min. He is agitated and mildly confused. His skin is cool and mottled. In this scenario, which is the best mode of fluid delivery?", "options": ["Left subclavian central line", "Long saphenous vein cut down", "Right internal jugular approach central line", "Left femoral long line", "Two wide-bore cannulae inserted bilaterally to the antecubital fossae"], "correct": 4, "difficulty": 3},
{"id": "surgery_00806", "q": "Intravenous fluid management in the trauma patient For the patient described in Question 2, which one of the following statements regarding fluid resuscitation is most correct?", "options": ["Hartmann’s solution should not be used?", "The best fluid replacement is cross-matched blood", "It is mandatory to use colloid over crystalloid", "Colloids are preferable to expand the intracellular volume", "Crystalloids should be avoided as they may cause anaphylaxis"], "correct": 1, "difficulty": 2},
{"id": "surgery_00807", "q": "A 26-year-old woman was brought to the emergency room after being stabbed in the left parasternal area. She is irritable but is breathing easily. Her blood pressure is 80/40mmHg and her pulse rate is 136/minute. Here neck veins are congested. The most probable diagnosis is:", "options": ["Hemothorax", "Open pneumothorax.", "Hemopneumothorax.", "Cardiac tamponade.", "Tension pneumothorax"], "correct": 3, "difficulty": 3},
{"id": "surgery_00808", "q": "All the following are indications for thoracotomy in a trauma victim, except:", "options": ["Chest tube drains 400ml fresh blood at insertion in the pleural cavity.", "Fresh blood drainage that continues at a rate more than 200ml/ hour.", "Persistent air leak from the chest tube.", "Associated esophageal injury.", "Foreign body in the chest."], "correct": 0, "difficulty": 2},
{"id": "surgery_00809", "q": "Postoperative Pulmonary embolism can cause any of the following, except:", "options": ["Postoperative vomiting.", "Postoperative tachycardia.", "Postoperative dyspnea.", "Postoperative chest pain.", "Sudden death."], "correct": 0, "difficulty": 1},
{"id": "surgery_00810", "q": "About the investigations for suspected pulmonary thromboembolism, all the following statements are true, except:", "options": ["A normal D dimer level excludes pulmonary thromboembolism.", "A normal chest X-ray cannot exclude pulmonary embolism.", "CT pulmonary angiography is the most popular imaging study.", "The major value of ECG is to differentiate PE from myocardial infarction.", "Ventilation - perfusion isotope scan shows lung areas that are perfused but not ventilated."], "correct": 4, "difficulty": 1},
{"id": "surgery_00811", "q": "About postoperative atelectasis all the following are true, except:", "options": ["It usually presents by hemoptysis.", "Upper abdominal incisions cause more atelectasis than lower abdominal incisions", "Atelectasis is one of the causes of postoperative fever.", "Dehydration is a predisposing factor.", "If neglected may cause pneumonia."], "correct": 0, "difficulty": 1},
{"id": "surgery_00812", "q": "The causes of postoperative fever include the following, except:", "options": ["Leakage from an intestinal anastomosis.", "Wound infection.", "Paralytic ileus.", "Deep vein thrombosis.", "Atelectasis and pulmonary infection."], "correct": 2, "difficulty": 1},
{"id": "surgery_00813", "q": "Which one of the following is a complication of type A aortic dissection?", "options": ["Aortic valve incompetence.", "Myocardial infarction.", "Pericardial effusion and tamponade.", "All of the above."], "correct": 3, "difficulty": 2},
{"id": "surgery_00814", "q": "The immediate life-threatening thoracic conditions in trauma include which of the following:", "options": ["Surgical emphysema.", "Single site fracture rib.", "Lung contusion.", "Tension Pneumothorax.", "Hemothorax."], "correct": 3, "difficulty": 1},
{"id": "surgery_00815", "q": "The treatment of choice in flail chest is:", "options": ["Tracheostomy.", "Intercostal nerve block.", "Adhesive strapping.", "Elevation of broken ribs with towel clips.", "Positive pressure ventilation."], "correct": 4, "difficulty": 2},
{"id": "surgery_00816", "q": "In tension pneumothorax, the incorrect statement among the following is that:", "options": ["There is a constant air leak from a tear in the lung or a valvular wound in the chest wall.", "Severe respiratory embarrassment is always present.", "Cardiac function is not affected.", "Surgical emphysema is common.", "There is displacement of the trachea and mediastinum to the opposite side."], "correct": 2, "difficulty": 1},
{"id": "surgery_00817", "q": "The most frequent cause of cyanosis under general anaesthesia:", "options": ["Inadequate ventilation.", "Vascular collapse,", "CNS depression,", "Direct myocardial irritability."], "correct": 0, "difficulty": 1},
{"id": "surgery_00818", "q": "Which of the following will give an air fluid level on CXR :", "options": ["Open pneumothorax .", "Loculated haemothorax .", "Clotted haemothorax .", "Haemopneumothorax ."], "correct": 3, "difficulty": 1},
{"id": "surgery_00819", "q": "In road traffic victim , the first priority of management is given to which of the following injuries:", "options": ["open pneumothorax on Rt side .", "tension pneumothorax on Lt side .", "bleeding scalp laceration .", "fracture of shaft of Lt femur ."], "correct": 1, "difficulty": 1},
{"id": "surgery_00820", "q": "The best modality for diagnosis of tension pneumothorax :", "options": ["clinical", "bronchoscopy", "CT-angio", "PET-CT"], "correct": 0, "difficulty": 1},
{"id": "surgery_00821", "q": "A 65 year old smoker came to you with dry irritant cough, numbness along the medial aspect of the right forearm and drooping of the right eyelid. On examination , the right pupil was constricted .Chest x-ray showed right apical lung opacity . The most possible diagnosis is :", "options": ["hemothorax", "pulmonary TB", "empyema", "bronchogenic carcinoma"], "correct": 3, "difficulty": 2},
{"id": "surgery_00822", "q": "A sucking chest wound (open pneumothorax) is immediately sealed by dressing which is fixed at:", "options": ["1 side", "2 sides", "3 sides", "4 sides"], "correct": 2, "difficulty": 1},
{"id": "surgery_00823", "q": "The main pathology in adult respiratory distress syndrome is:", "options": ["pulmonary fibrosis", "endothelial damage", "round cell carcinoma", "emphysema"], "correct": 1, "difficulty": 1},
{"id": "surgery_00824", "q": "Massive pulmonary embolism presents by", "options": ["precordial chest pain", "pleuritic chest pain", "back pain", "silent"], "correct": 0, "difficulty": 1},
{"id": "surgery_00825", "q": "Regarding extracorporeal circulation for cardiac surgery, select the right answer:", "options": ["Used in correction of aortic coarctation", "Venous blood is collected via the right ventricle", "Hypothermia will increase the risk of the procedure", "Cardioplegia is required"], "correct": 3, "difficulty": 1},
{"id": "surgery_00826", "q": "Which of the following is an indication for percutaneous transluminal coronary angioplasty?", "options": ["Single lesion in the left anterior descending", "Single lesion in the main trunk of the left coronary", "Three vessel disease", "Long-segment narrowing"], "correct": 0, "difficulty": 2},
{"id": "surgery_00827", "q": "Treatment of a small flail chest without compromise to ventilation is:", "options": ["Stabilization by cotton pad and adhesive plaster", "Intubation and ventilation", "Fixation by plates and screws", "Excision of the flail segment"], "correct": 0, "difficulty": 2},
{"id": "surgery_00828", "q": "Indications of thoracotomy in cases of hemothorax include which of the following:", "options": ["Drainage of more than 200 ml after tube insertion", "Bleeding more than 20 ml/hour", "Clotted hemothorax", "Associated fracture rib"], "correct": 2, "difficulty": 2},
{"id": "surgery_00829", "q": "The first aid treatment of open pneumothorax is to apply an impermeable square shaped dressing that is fixed at:", "options": ["1 side", "2 sides", "3 sides", "4 sides"], "correct": 2, "difficulty": 1},

{"id": "surgery_00830", "q": "The radiological investigation of choice to diagnose a patient with suspected real colic", "options": ["Ascending cystogram", "Abdominal Ultrasound", "CT urinary tract (non-contrast)", "KUB", "MRI"], "correct": 2, "difficulty": 1},
{"id": "surgery_00831", "q": "Nocturia is defined as:", "options": ["Passage of necrotic tissues in urine", "Involuntary escape of urine at night", "Sudden severe desire to micturate", "All of the above", "None of the above"], "correct": 4, "difficulty": 1},
{"id": "surgery_00832", "q": "A 55-year-old male patient is presenting with total painless hematuria. Which of the following is not part of the evaluation for hematuria:", "options": ["History and physical examination", "Urine cytology", "imaging by Ultrasound or IVP", "cystoscopy", "cystemetry"], "correct": 4, "difficulty": 2},
{"id": "surgery_00833", "q": "In a young man with acute scrotal pain, features consistent with acute testicular torsion include all the following EXCEPT:", "options": ["acute onset of pain radiating to the lower abdominal quadrant", "absent cremasteric reflex", "dysuria and frequency", "high riding, transversely lying testis", "scrotal swelling"], "correct": 2, "difficulty": 1},
{"id": "surgery_00834", "q": "Regarding renal injuries (choose the incorrect answer)", "options": ["they are relatively rare as the kidney is well protected by the rib cage and heavy muscles of the back", "blunt injuries are more common than penetrating injuries", "treatment is usually surgical", "assessment of contralateral kidney is very important..", "CT scan is the study of choice"], "correct": 2, "difficulty": 2},
{"id": "surgery_00835", "q": "In a patient with post-traumatic fracture of the bony pelvis and suspected injury of the posterior urethra, the investigation of choice to assess urethral integrity is:", "options": ["Pelvic ultrasound.", "PUT (Plain Urinary Tract).", "IVU (intravenous urography).", "Ascending urethrogram", "Urodynamic evaluation."], "correct": 3, "difficulty": 1},
{"id": "surgery_00836", "q": "The standard management of a confirmed case of acute testicular torsion is:", "options": ["exploration with detorsion and orchiopexy of the affected testis", "exploration with detorsion and bilateral orchiopexy", "manual detorsion and strict follow up.", "warm foments and antibiotics for 5 days.", "warm foments and antibiotics for 2 days then surgical exploration"], "correct": 1, "difficulty": 2},
{"id": "surgery_00837", "q": "Uric acid calculi", "options": ["Are typically radiolucent.", "May be present in patients with gout", "May be due to chemotherapy for leukemias and lymphomas.", "All of the above"], "correct": 3, "difficulty": 1},
{"id": "surgery_00838", "q": "Regarding urinary calculi", "options": ["The most common type is uric acid stones", "Most types are radiolucent", "Renal stones are always symptomatic", "Small ureteric stones are reliably identified on abdominal ultrasound", "None of the above"], "correct": 4, "difficulty": 1},
{"id": "surgery_00839", "q": "Bladder stones have been associated with the following except:", "options": ["squamous carcinoma of the urothelium", "non-absorbable sutures in the bladder", "obstructive large prostate hypertrophy", "urgency and frequency", "hypospadias"], "correct": 4, "difficulty": 1},
{"id": "surgery_00840", "q": "A previously fit young woman of 28 years presents with acute loin pain. She’s afebrile and vitally stable. An emergency IVU shows a right moderate hydronephrosis with obstruction of the right ureter caused by an 8-mm stone impacted in the right lower ureter. The most appropriate immediate treatment will be:", "options": ["midstream urine sample, antibiotics and observe for 48 hours before any further intervention", "immediate percutaneous nephrostomy", "cystoscopy and the passage of a ureteric catheter to relieve the obstruction", "ureteroscopy with endoscopic removal of stone", "analgesia and a forced diuresis"], "correct": 4, "difficulty": 3},
{"id": "surgery_00841", "q": "A 6-year-old man has sudden dull, right fank pain, nausea and gross hematuria. KUB shows no significant calcifications. IVP shows non-function of the right kidney with developing dense nephrogram effect at six bours. The next step should be", "options": ["non contrast CT scan", "renal scan", "renal angiography", "renal ultrasound", "retrograde pyelography"], "correct": 0, "difficulty": 2},
{"id": "surgery_00842", "q": "The first line of medical treatment of PH", "options": ["hormonal treatment to reduce prostate size", "alpha blockers", "decongestant suppositories", "diuretics", "None of the above"], "correct": 1, "difficulty": 1},
{"id": "surgery_00843", "q": "In calcular anuria", "options": ["The urine output is less than 200cc/ 24 hrs", "The urinary bladder is usually empty on ultrasound", "Drainage of the obstructed kidney is the mainstay of management", "All of the above", "None of the above"], "correct": 2, "difficulty": 2},
{"id": "surgery_00844", "q": "In obstructive uropathy, all statements are true except", "options": ["Some patients may require dialysis", "Drainage of the kidney is the mainstay of management", "May occur with bilateral ureteric obstruction", "IVP usually done", "Infection aggravates renal function deterioration"], "correct": 3, "difficulty": 2},
{"id": "surgery_00845", "q": "A urethral stricture may develop in men as a consequence of:", "options": ["an indwelling catheter", "gonocaccal urethritis", "urethral instrumentation,", "urethral trauma", "all of the above"], "correct": 4, "difficulty": 1},
{"id": "surgery_00846", "q": "Most common organism in urinary tract infections is:", "options": ["Chylamydia trachomatis", "Eoli", "Gonococci", "Staphylococci", "Streptococci"], "correct": 1, "difficulty": 1},
{"id": "surgery_00847", "q": "Urinary Bilharziasis", "options": ["is mainly caused by Schistosoma mansoni", "the commonest site is the urinary bladder", "total hematuria is the commonest type of hematuria", "Ureteric fibrosis and obstruction is not a usual event", "is treated by antibiotics"], "correct": 1, "difficulty": 1},
{"id": "surgery_00848", "q": "Which of the following is NOT a predisposing factor for Urinary Tract Infections?", "options": ["corticosteroid treatment", "diabetes mellitus", "high-protein diet", "ureteral obstruction", "urinary stones"], "correct": 2, "difficulty": 1},
{"id": "surgery_00849", "q": "In a 20-year-old male with acute scrotal pain, the diagnosis of ”acute epididymo-orchitis” is more likely with which of the following features?", "options": ["an inguinoscrotal swelling showing an impluse on cough", "a tranversely high-lying testicle", "dysuria and pyuria", "recent history of trauma"], "correct": 2, "difficulty": 2},
{"id": "surgery_00850", "q": "Painless haematuria in a male patient aged 78 years could be due to all the following except:", "options": ["renal cell carcinoma", "bladder carcinoma", "seminoma", "ureteric carcinoma", "renal pelvic tumor"], "correct": 2, "difficulty": 1},
{"id": "surgery_00851", "q": "A suitable treatment option for localized prostate cancer is:", "options": ["Radiotherapy", "Chemotherapy", "Bilateral orchiectomy", "Immunotherapy", "Estrogen"], "correct": 0, "difficulty": 2},
{"id": "surgery_00852", "q": "The majority of men diagnosed with prostate cancer have their biopsies done because of:", "options": ["Hematuria", "Elevated PSA", "Painful ejaculation", "Urinary frequency", "Urinary incontinence"], "correct": 1, "difficulty": 1},
{"id": "surgery_00853", "q": "Hormonal management of metastatic prostatic carcinoma includes:", "options": ["bilateral orchidectomy", "oestrogen", "LHRH agonists", "LHRH antagonist", "all of the above"], "correct": 4, "difficulty": 1},
{"id": "surgery_00854", "q": "The most frequent site of distant metastases in prostates carcinoma is:", "options": ["lungs", "lymph nodes", "liver", "bones", "brain"], "correct": 3, "difficulty": 1},
{"id": "surgery_00855", "q": "The gold standard for treatment of muscle-invasive bladder cancer is", "options": ["Systemic chemotherapy", "External beam radiotherapy", "Brachytherapy", "Radical cystectomy with urinary diversion", "Transurethral resection (TU)"], "correct": 3, "difficulty": 2},
{"id": "surgery_00856", "q": "The most useful imaging modality to assess the local and regional spread of bladder cancer is:", "options": ["Bone scan", "CT abdomen and pelvis", "Cystography", "IVP with delayed films", "Ultrasound"], "correct": 1, "difficulty": 2},
{"id": "surgery_00857", "q": "Squamous cell carcinoma of the urinary", "options": ["Is sensitive to radiotherapy.", "If superficial, it may be treated endoscopically by transurethral resection of the tumor.", "Radical cystectomy is the treatment of choice.", "All of the above", "B and C only"], "correct": 2, "difficulty": 2},
{"id": "surgery_00858", "q": "Which of the following can be seen in patients with renal cell carcinoma?", "options": ["non-reducing varicocele", "Hypertension", "Hypercalcemia", "Erythrocytosis", "All of the above"], "correct": 4, "difficulty": 1},
{"id": "surgery_00859", "q": "Which of the following treatment modalities is most suitable for the management of renal cell carcinoma?", "options": ["Endoscopic resection", "Radical surgery", "Radiotherapy", "Chemotherapy", "Hormonal therapy"], "correct": 1, "difficulty": 1},
{"id": "surgery_00860", "q": "Regarding Torsion testis, the untrue statement is", "options": ["Testicular torsion is a surgical emergency even if you are in doubt of diagnosis.", "It is clinically difficult to differentiate torsion testis from acute epidydmo-orchitis", "Doppler ultrasound should be done postoperative to ensure patency of blood supply", "Surgical treatment expose the two testes at the same time."], "correct": 2, "difficulty": 1},
{"id": "surgery_00861", "q": "The following test is most useful to differentiate between a renal cyst and a solid renal mass:", "options": ["Plain X-ray of the urinary tract", "Intravenous urography", "Retrograde pyelography", "Abdominal ultrasound"], "correct": 3, "difficulty": 1},
{"id": "surgery_00862", "q": "Regarding Pelvi-ureteric Junction Obstruction (CHOOSE THE INCORRECT ANSWER)", "options": ["It is a common cause of hydronephrosis in children and adolescents", "It may be discovered by prenatal sonography", "It usually affects one kidney", "Endosopic management is used in most cases of congenital pelvi-ureteric junction obstruction."], "correct": 3, "difficulty": 1},
{"id": "surgery_00863", "q": "In a patient who sustained renal trauma, conservative (non-operative) management is most suit able when:", "options": ["There is a renal pedicle injury.", "The trauma is penetrating", "There is a 2 cm parenchymal laceration not reaching the pelvicalyceal system (grade III injury)", "There is evidence of persistent renal bleeding with a hemodynamically unstable patient"], "correct": 2, "difficulty": 2},
{"id": "surgery_00864", "q": "Predisposing factors for Urinary Tract Infections include the following EXCEPT:", "options": ["Immunocomprimized state", "Male gender", "Urinary stasis", "Urinary catheterization"], "correct": 1, "difficulty": 1},
{"id": "surgery_00865", "q": "Most common organism in urinary tract infections is:", "options": ["Chylamydia trachomatis", "Eoli", "Gonococci", "Staphylococci"], "correct": 1, "difficulty": 1},
{"id": "surgery_00866", "q": "Urinary Bilharziasis", "options": ["Imainly s caused by Schistosoma mansoni", "Affection of the lower ureter is common", "Total hematuria is the commonest type of hematuria", "Ureteric fibrosis and obstruction is not a usual event"], "correct": 1, "difficulty": 1},
{"id": "surgery_00867", "q": "The ideal stone for extracorporeal shockwave lithotripsy is", "options": ["Radiolucent stone in the kidney", "Radio-opaque stone in the kidney less than 2 cm", "Radio-opaque stone in the kidney more than 2 cm", "Cases associated with ureteric stricture"], "correct": 1, "difficulty": 1},
{"id": "surgery_00868", "q": "Percutaneous nephrolithotomy", "options": ["Is best indicated for large renal stones > 2 cm", "Is indicated in failures of extracorporeal shockwave lithotripsy", "Is contraindicated in cases with bleeding diasthesis", "All of the above"], "correct": 3, "difficulty": 1},
{"id": "surgery_00869", "q": "A patient complaining of chronic retention with mild renal impairement due to BPH is best treated by:", "options": ["Alpha blocker", "Decongestant suppos", "Phytotherapy", "TURP or open prostatectomy."], "correct": 3, "difficulty": 2},
{"id": "surgery_00870", "q": "The first line of medical treatment of BPH is:", "options": ["Hormonal treatment to reduce prostate size", "Alpha blockers", "Decongestant suppositories", "Diuretics."], "correct": 1, "difficulty": 1},
{"id": "surgery_00871", "q": "In calcular anuria", "options": ["The urine output is less than 200 cc/24 hours", "The urinary bladder is usually empty on ultrasound", "Drainage of the obstructed kidney is the mainstay of management", "All of the above"], "correct": 3, "difficulty": 2},
{"id": "surgery_00872", "q": "Risk factors for bladder cancer include all the following except", "options": ["Aniline dyes", "Deletion in the short arm of chromosome 3", "Deletion in chromosome 9", "P53 mutations"], "correct": 1, "difficulty": 1},
{"id": "surgery_00873", "q": "Urine cytology is most likely to be positive in", "options": ["Advanced Renal cell carcinoma", "High-grade Prostate adenocarcinoma", "High-grade transitional cell carcinoma of the bladder", "Low-grade transitional cell carcinoma of the bladder"], "correct": 2, "difficulty": 1},
{"id": "surgery_00874", "q": "Following TUR-BT for superficial bladder cancer, the following agents can be used for intravesi cal therapy except:", "options": ["5-fluorouracil", "Adriamycin", "BCG", "Mitomycin C"], "correct": 0, "difficulty": 1},
{"id": "surgery_00875", "q": "A scrotal condition that causes acute pain and necessitates emergency", "options": ["Epididymo-orchitis", "Reducible inguinoscrotal hernia", "Vaginal hydrocele", "Testicular torsion"], "correct": 3, "difficulty": 1},
{"id": "surgery_00876", "q": "Which of the following statements is not a feature of the horseshoe kidney?", "options": ["It may present by hydronephrosis, infection, stones, or palpable mass below the umbilicus", "Calyces of the lower renal pole lie laterally in relation to the ureters.", "The kidneys are joined at their lower poles (in 95%) by midline parenchymal tissue (the isth mus).", "Renal function is usually normal."], "correct": 1, "difficulty": 1},
{"id": "surgery_00877", "q": "A Renal mass showing the presence of fat tissue on imaging is most likely a (an):", "options": ["Angiomyolipoma", "Oncocytoma", "Renal cell carcinoma", "Transitional cell carcinoma of the upper tract"], "correct": 0, "difficulty": 1},
{"id": "surgery_00878", "q": "Metabolic causes of renal stone formation include all the following except:", "options": ["Hypercalcuria", "Cystinuria", "Renal tubular acidosis", "Myxoedema"], "correct": 3, "difficulty": 1},
{"id": "surgery_00879", "q": "A 46-year-old man has sudden, dull, right flank pain, nausea and gross haematuria. KUB shows no significant calcification. IVP shows non-function of the right kidney with developing dense ephrogram effect at six hours. The next step should be:", "options": ["Non-contrast CT scan", "Renal angiography", "Renal ultrasound", "Retrograde pyelogram"], "correct": 0, "difficulty": 2},
{"id": "surgery_00880", "q": "A urethral stricture may develop in men as a consequence of:", "options": ["An indwelling catheter", "Gonocaccal urethritis", "Urethral trauma", "All of the above"], "correct": 3, "difficulty": 1},
{"id": "surgery_00881", "q": "A previously fit young woman of 28 years presents with acute loin pain. She’s afebrile and vital ly stable. An emergency IVU shows a right moderate hydronephrosis with obstruction of the right ureter caused by an 8-mm stone impacted in the right lower ureter. The most appropriate immediate treatment will be:", "options": ["midstream urine sample, antibiotics and observe for 48 hours before any further intervention", "immediate percutaneous nephrostomy", "cystoscopy and the passage of a ureteric catheter to relieve the obstruction", "ureteroscopy with endoscopic removal of stone"], "correct": 3, "difficulty": 3},
{"id": "surgery_00882", "q": "In renal cell carcinoma, TNM stage T2NOMO indicates:", "options": ["Tumour <7 cm, limited to the kidney", "Tumour > 7 cm, limited to the kidney", "Tumour invading beyond Gerota’s fascia", "Regional lymph node involvement"], "correct": 1, "difficulty": 1},
{"id": "surgery_00883", "q": "Painless haematuria in a male patient aged 78 years could be due to all the following except:", "options": ["Renal cell carcinoma", "Bladder carcinoma", "Seminoma", "Ureteric carcinoma"], "correct": 2, "difficulty": 1},
{"id": "surgery_00884", "q": "Phimosis:", "options": ["May result in a pulmonary embolus", "Is most commonly the outcome of trauma", "Usually involves the corpus cavernosum", "Usually resolves spontaneously in childhood"], "correct": 3, "difficulty": 1},
{"id": "surgery_00885", "q": "Which of the following conditions may lead to elevated PSA", "options": ["Benign prostatic hyperplasia", "Prostate cancer", "Prostate inflammation", "All of the above"], "correct": 3, "difficulty": 1},
{"id": "surgery_00886", "q": "A grading system commonly used to evaluate prostate cancer is", "options": ["Gleason grading", "Furhman grading", "Nuclear grading", "Von Hippel score"], "correct": 0, "difficulty": 1},
{"id": "surgery_00887", "q": "Which of the following investigations is NOT helpful in the assessment of a patient with suspected perinephric abscess?", "options": ["Abdominal ultrasound", "CT abdomen and pelvis", "Filling cystometry", "Total leukocytic count"], "correct": 2, "difficulty": 1},
{"id": "surgery_00888", "q": "Typical features of renal colic caused by a ureteric stone include all the following except:", "options": ["Acute onset", "Association with nausea and possibly vomiting", "Colicky or aching in nature", "Positional (changes with changes in position or posture)"], "correct": 3, "difficulty": 1},
{"id": "surgery_00889", "q": "Advantages of CT urinary tract in the evaluation of a patient with renal colic include all the following EXCEPT:", "options": ["High sensitivity for diagnosing ureteric stones", "Identification of other (non-stone) causes of flank pain", "Less expensive than other imaging modalities", "No need for contrast administration"], "correct": 2, "difficulty": 1},
{"id": "surgery_00890", "q": "Nocturia is defined as:", "options": ["Passage of necrotic tissues in urine", "Involuntary escape of urine at night", "Sudden severe desire to micturate", "None of the above"], "correct": 3, "difficulty": 1},
{"id": "surgery_00891", "q": "Urgency is defined as:", "options": ["Sudden strong desire to void.", "Loss of urine due to defective urethral sphincter.", "Loss of urine due to physical strain.", "Burning sensation when passing urine"], "correct": 0, "difficulty": 1},
{"id": "surgery_00892", "q": "A scrotal condition that causes acute pain and necessitates emergency surgery is", "options": ["Epididymo-orchitis", "Reducible inguinoscrotal hernia", "Vaginal hydrocele", "Testicular torsion"], "correct": 3, "difficulty": 1},
{"id": "surgery_00893", "q": "Regarding renal injuries", "options": ["they are relatively common as the kidney is a relatively superficial organ", "penetrating injuries are more common than blunt injuries", "absence of hematuria does not exclude renal injury", "renal exploration is usually necessary to assess grade of injury", "IVP is the imaging study of choice"], "correct": 2, "difficulty": 2},
{"id": "surgery_00894", "q": "The nerve that is found within the spermatic cord?", "options": ["Ilioinguinal nerve", "Genitofemoral nerve", "Genital branch of the genitofemoral nerve", "Ilio-hypogastric nerve", "Lateral femoral cutaneous nerve"], "correct": 2, "difficulty": 1},
{"id": "surgery_00895", "q": "Which of the following abdominal organs is not classified as intraperitoneal?", "options": ["Ureters", "Transverse colon", "Stomach", "Gallbladder", "Caecum."], "correct": 0, "difficulty": 1},
{"id": "surgery_00896", "q": "“Painless haematuria in a male patient aged 78 years could be due to all the following except:", "options": ["renal cell carcinoma", "bladder carcinoma", "seminoma", "ureteric carcinoma", "BPH"], "correct": 2, "difficulty": 1},
{"id": "surgery_00897", "q": "Posterior urethral valve is best diagnosed by:", "options": ["Plain X-ray of the urinary tract", "Intravenous urography", "Antegrade pyelography", "Ascending urethrogram", "Micturating cysto-urethrogram"], "correct": 4, "difficulty": 1},
{"id": "surgery_00898", "q": "Urinary bladder injuries", "options": ["Are frequently associated with pelvic fractures", "Are either extraperitoneal or intraperitoneal", "Ascending cystogram provides the definite diagnostic study by demonstrating leakage of con trast outside the bladder", "All of the above", "B and C only"], "correct": 3, "difficulty": 1},
{"id": "surgery_00899", "q": "In Urinary tract infections", "options": ["E.coli from the colon is the main organism", "Is more common in females", "Urinary stasis and catheterization are major predisposing factors", "All of the above", "None of the above"], "correct": 3, "difficulty": 1},
{"id": "surgery_00900", "q": "Oliguria: All The Following Are True Except", "options": ["Is Defined As Urine Output Less Than 2 Ml/Kg/H.", "May Be Due To Inadequate Fluid Replacement.", "Common In Cases Of Obstructive Jaundice.", "May Complicate Cases Of Aortic Surgery.", "CVP May Be Low."], "correct": 0, "difficulty": 1},
{"id": "surgery_00901", "q": "Partial Nephrectomy For Renal Cell Carcinoma:", "options": ["Can Be Done In Solitary Kidney.", "Can Be Done In Lesions Less Than 4 Cm.", "Para-Aortic Lymph Nodes Should Always Be Removed.", "Can Be Done Even With IVC Involvement."], "correct": 0, "difficulty": 2},
{"id": "surgery_00902", "q": "Predisposing Factors Of Torsion Of The Spermatic Cord Are EXCEPT:", "options": ["High Investment Of The Tunica Vaginalis.", "Long Mesorchuim.", "Transverse Lie Of The Testis.", "Lipoma Of The Cord."], "correct": 3, "difficulty": 1},
{"id": "surgery_00903", "q": "Hypernephroma:", "options": ["Is An Adenocarcinoma.", "Late To Invade The Renal Pelvis.", "Arise From Proximal Convoluted Tubules.", "Contains High Amount Of Lipid."], "correct": 2, "difficulty": 1},
{"id": "surgery_00904", "q": "What is the blood supply of the upper ureter?", "options": ["Aorta and renal arteries.", "Lumbar arteries.", "Internal iliac artery.", "Extremal iliac artery."], "correct": 0, "difficulty": 1},
{"id": "surgery_00905", "q": "The testicular is a branch of", "options": ["Aorta", "Renal artery", "Common iliac artery", "External iliac artery"], "correct": 0, "difficulty": 1},
{"id": "surgery_00906", "q": "A hard mass in the testes in a 30-year-old male is best diagnosed by", "options": ["Core needle biopsy.", "FNAC", "Orchidectomy", "Open biopsy"], "correct": 2, "difficulty": 2},
{"id": "surgery_00907", "q": "Alpha fetoprotein and chorionic gonadotropin are elevated in:", "options": ["Seminomas.", "Non-seminoma germ cell tumor.", "In Sertoli cell tuniour.", "None of the above."], "correct": 1, "difficulty": 1},
{"id": "surgery_00908", "q": "A longstanding urinary stone may increase the risk of which one of the following types of carci noma?", "options": ["Transitional cell carcinoma.", "Squamous cell carcinoma.", "Adenocarcinoma.", "None of the above.", "All of the above."], "correct": 1, "difficulty": 1},
{"id": "surgery_00909", "q": "After transurethral resection of superficial rec, local bladder instillation of which of the following is recommended to decrease the risk of recurrence?", "options": ["Cis-platinum.", "Methotrexate.", "BCG (Bacille Calmette and Guerin) vaccine.", "Adriamycin."], "correct": 2, "difficulty": 1},
{"id": "surgery_00910", "q": "In patients with lypernephroma (renal cell carcinoma) with IVC tumor thrombus are best treated by:", "options": ["Chemotherapy.", "Radiotherapy.", "Chemotherapy and radiotherapy.", "Open surgery."], "correct": 3, "difficulty": 2},
{"id": "surgery_00911", "q": "What is the most common urinary diversion procedure done following total cystectomy?.", "options": ["Rectal bladder.", "Ileal conduit", "Cutaneous (ureterostomy).", "None of the above."], "correct": 1, "difficulty": 1},
{"id": "surgery_00912", "q": "About polycystic kidney disease, all the following statements are true, except:", "options": ["It is an X-linked recessive disease.", "The disease is always affects both kidneys.", "The disease is always progressive.", "The disease causes hypertension.", "The disease ultimately causes renal failure."], "correct": 0, "difficulty": 1},
{"id": "surgery_00913", "q": "A 49- year old man had hemorrhoidectomy. After recovery from anaethesia he complains of painful inability to pass urine. The first step is:", "options": ["administration of alpha 1 reductase inhibitor.", "Administration of parenteral analgesia.", "Evacuation of the urinary bladder with a catheter then removal of the catheter.", "Placement of a self-retaining catheter and investigation of the possible cause.", "Urgent suprapubic cystostomy."], "correct": 3, "difficulty": 2},
{"id": "surgery_00914", "q": "five hours after she was hit by a car, a 32-year-old woman presents to the emergency room complaining of left flank pain and gross hematuria, she is hemodynamically stable. The next step in management is:", "options": ["Exploratory laparotomy.", "Diagnostic peritoneal lavage.", "Intravenous urography.", "Triple contrast CT scan of the abdomen.", "Blood transfusion."], "correct": 3, "difficulty": 2},
{"id": "surgery_00915", "q": "The treatment of metastatic prostate cancer is:", "options": ["Luteinizing hormone-releasing hormone (LRH) agonist.", "External radiotherapy.", "Interstitial radiotherapy (brachytherapy).", "Radical prostatectomy.", "Corticosteroid therapy."], "correct": 0, "difficulty": 1},
{"id": "surgery_00916", "q": "About testicular malignancies, one statement only is true:", "options": ["These are the commonest malignant tumours in males.", "Percutaneous scrotal biopsy should be avoided.", "They are usually resistant to chemotherapy.", "In a seminoma, alpha fetoprotein is elevated.", "A seminoma spreads to inguinal lymph nodes."], "correct": 1, "difficulty": 1},
{"id": "surgery_00917", "q": "The commonest symptom of a renal cell carcinoma is:", "options": ["Renal colic.", "Varicocele.", "Abdominal mass.", "Jaundice.", "Hematuria."], "correct": 4, "difficulty": 1},
{"id": "surgery_00918", "q": "One of the following symptoms is specific to cancer bladder", "options": ["Hematuria", "Burning micturition.", "Pneumaturia.", "Necroturia", "Frequency."], "correct": 2, "difficulty": 1},
{"id": "surgery_00919", "q": "Which one of the following is not a complication of ectopic testis?", "options": ["Increased incidence of torsion", "Infertility", "Increased risk of malignancy", "Delayed development of secondary sexual characteristics.", "Increased incidence of testicular trauma."], "correct": 3, "difficulty": 1},
{"id": "surgery_00920", "q": "The renal arteries arise at intervertebral level", "options": ["T11/T12", "T12/L1", "L1/L2", "L2/L3", "L3/L4"], "correct": 2, "difficulty": 1},
{"id": "surgery_00921", "q": "Which one of the following statements regarding renal cell carcinoma is true?", "options": ["It is an incidental finding in approximately 30% of patients.", "Women are more commonly affected than men.", "Approximately 5% of cases are familial.", "Renal cell carcinoma accounts for around 3% of adult cancers.", "Metastases are poorly visualized by standard imaging techniques."], "correct": 3, "difficulty": 1},
{"id": "surgery_00922", "q": "With regard to carcinoma of the bladder, which one of the following statements is not correct?", "options": ["Epithelial tumors account for the majority of bladder tumors.", "It accounts for 1 in every 5000 new cases of cancer in the United Kingdom.", "Males are more commonly affected than females.", "There is a strong correlation with exposure to industrial dyes.", "It frequently presents with painful hematuria."], "correct": 4, "difficulty": 1},
{"id": "surgery_00923", "q": "The blood supply of the upper ureter?", "options": ["Aorta and renal arteries.", "Lumbar arteries.", "Internal iliac artery.", "External iliac artery."], "correct": 0, "difficulty": 1},
{"id": "surgery_00924", "q": "Patients with benign prostatic hypertrophy is initially treated by", "options": ["Alpha blockers", "Alpha stimulants", "Beta blockers", "Beta stimulants"], "correct": 0, "difficulty": 1},
{"id": "surgery_00925", "q": "Alpha fetoprotein and chorionic gonadotropin are elevated in:", "options": ["Seminomas.", "Non-seminoma germ cell tumor", "In Sertoli cell tumor.", "None of the above."], "correct": 1, "difficulty": 1},
{"id": "surgery_00926", "q": "Which of the following vessels contributes to the blood supply of the prostate gland?", "options": ["Coeliac plexus", "Superior mesenteric artery", "Inferior mesenteric artery", "Internal iliac artery", "External iliac artery"], "correct": 3, "difficulty": 1},
{"id": "surgery_00927", "q": "Which of the following structures is not found within the spermatic cord?", "options": ["Vas deferens", "Ilioinguinal nerve", "Genital branch of the genito-femoral nerve", "Pampiniform plexus of veins", "Testicular artery."], "correct": 1, "difficulty": 1},
{"id": "surgery_00928", "q": "Urinary bilharziasis", "options": ["Is caused by Schistosoma mansoni mainly", "Affection of the lower ureter is common", "Total hematuria is the commonest type of hematuria", "Ureteric fibrosis and obstruction is not a usual event", "None of the above."], "correct": 1, "difficulty": 1},
{"id": "surgery_00929", "q": "Uric acid calculi", "options": ["Are radiolucent", "May be present in patients with gout", "May be due to chemotherapy for leukemias and lymphomas", "All of the above", "None of the above"], "correct": 3, "difficulty": 1},
{"id": "surgery_00930", "q": "The ideal stone for extracorporeal shockwave lithotripsy is", "options": ["Radiolucent stone in the kidney", "Radio-opaque stone in the kidney less than 2 cm", "Radio-opaque stone in the kidney more than 2 cm", "Cases associated with ureteric stricture", "None of the above"], "correct": 1, "difficulty": 1},
{"id": "surgery_00931", "q": "Wilm’s tumor (nephroblastoma) (choose the incorrect answer)", "options": ["Accounts for 10% of childhood malignancies", "Usually occurs in children before the age of 7 years", "The main presentation is an abdominal mass", "Surgical treatment is the cornerstone of therapy in all children with Wilm’s tumor", "Chemotherapy and radiotherapy do not improve prognosis"], "correct": 4, "difficulty": 1},
{"id": "surgery_00932", "q": "Urgency is defined as:", "options": ["Sudden strong desire to void with involuntary loss of some urine.", "Loss of urine due to defective urethral sphincter.", "Loss of urine due to physical strain.", "All of the above", "None of the above"], "correct": 4, "difficulty": 1},
{"id": "surgery_00933", "q": "Most common organism in urinary tract infections Is:", "options": ["Staphylococci", "Streptococci", "E coli", "Chylamydia trachomatis", "Gonococci"], "correct": 2, "difficulty": 1},
{"id": "surgery_00934", "q": "Orchoipexy for the Testis is performed in", "options": ["Undescended Testis", "Retractile Testis", "Absent Testis", "vaginal Hydrocele of testis"], "correct": 0, "difficulty": 1},
{"id": "surgery_00935", "q": "Which of the following is a contraindication of circumcision?", "options": ["Phimosis.", "Pamphimosis.", "Hypospadias", "Failure of the prepuce to retract."], "correct": 2, "difficulty": 1},
{"id": "surgery_00936", "q": "staghorn calculus is made of:", "options": ["calcium phosphate", "urate", "cysteine", "oxalate"], "correct": 0, "difficulty": 1},
{"id": "surgery_00937", "q": "Unilateral hydronephrosis is due to:", "options": ["Bladder neck contracture.", "Ureterocele.", "Stricture urethra.", "Prostatic carcinoma."], "correct": 1, "difficulty": 1},
{"id": "surgery_00938", "q": "A 30 y old ml presented to you with an epigastric mass l5 cm in diameter After you excised the mass surgically, the pathology showed a seminoma. The fault In this case you didn’t:", "options": ["Examine the scrotum.", "probably examine the abdomen.", "order alpha-feto-protein makers,", "order CT abdomen."], "correct": 0, "difficulty": 2},
{"id": "surgery_00939", "q": "in undescended testis:", "options": ["occur in 1 /10000 boys", "most common site is in femoral region", "sterility occur in unilateral cases", "associated with increased risk of malignancy"], "correct": 3, "difficulty": 1},
{"id": "surgery_00940", "q": "In testicular tumor, one the following is FALSE:", "options": ["Seminoma is the commonest neoplasm", "teratoma is characteristically shows heterogeneous cut section with areas of hemorrhage and necrosis", "Alpha fetoprotein is always elevated in melanoma", "Seminoma is radiosensitive"], "correct": 2, "difficulty": 1},
{"id": "surgery_00941", "q": "most common tumor of urinary bladder:", "options": ["squamous cell carcinoma", "transitional cell carcinoma", "rhabdomyosarcoma", "sarcoma"], "correct": 1, "difficulty": 1},
{"id": "surgery_00942", "q": "Undescended testes are usually repaired at which age?", "options": ["At puberty.", "In infancy.", "Before 2 years of age.", "Before 6 years of age."], "correct": 3, "difficulty": 1},
{"id": "surgery_00943", "q": "In unilateral undescended testis the following is TRUE:", "options": ["Occur in 1/1000 boys", "Most common site is in femoral region", "Associated with normal fertility", "Associated with increased risk of malignancy"], "correct": 3, "difficulty": 1},
{"id": "surgery_00944", "q": "In testicular tumors the following are true EXCEPT:", "options": ["Seminoma is the commonest neoplasm", "Teratoma is characteristically shows heterogeneous cut section with areas of hemorrhage and necrosis", "Alpha fetoprotein is always elevated in seminoma", "Seminoma is radiosensitive"], "correct": 2, "difficulty": 1},
{"id": "surgery_00945", "q": "Which of the following is considered retroperitoneal tumor :", "options": ["Mesothelioma .", "Renal cell carcinoma .", "Desmoid tumor .", "Sacrococcygeal teratoma ."], "correct": 1, "difficulty": 1},
{"id": "surgery_00946", "q": "hydrocele is acollection of fluid between", "options": ["cremasteric and external spermatic fascia", "cremateric fascia and internal spermatic fascia", "the parietal and visceral layer of tunica vaginalise", "none of the above"], "correct": 2, "difficulty": 1},
{"id": "surgery_00947", "q": "An 18 year old boy came to you with severe pain in the right scrotum of a few hours duration fol lowing a minor trauma . on examination the right testis was higher , its cord was thicker , pinch ing test was positive , there was negative transillumination and the left testis had a transverse lie. The best management is :", "options": ["antibiotic and elevation", "blood film for filariasis", "cold foments and taxis", "urgent surgery"], "correct": 3, "difficulty": 3},
{"id": "surgery_00948", "q": "Pneumaturia can be caused by :", "options": ["retroperitoneal tumors", "stone bladder", "schistozomiasis", "colonic diverticulitis"], "correct": 3, "difficulty": 1},
{"id": "surgery_00949", "q": "In seminoma not infiltrating the scrotum , these nodes may be infiltrated :", "options": ["medial group of the superficial inguinal nodes", "node of Cloquet", "paraaortic nodes above the umbilicus", "paraaortic nodes below the umbilicus"], "correct": 3, "difficulty": 1},
{"id": "surgery_00950", "q": "In cases of varicocele, which of the following is an indication of surgery?", "options": ["azospermia", "oligozospermia", "associated hypernephroma", "reversal of flow on duplex"], "correct": 2, "difficulty": 2},
{"id": "surgery_00951", "q": "A 67 year old male came complaining of difficulty in micturition. Digital rectal examination revealed an irregular induration obliterating the median sulcus of the prostate. The serum PSA was 14 ng/ml. The next step would be:", "options": ["Transrectal ultrasonography and biopsy", "Transurethral resection of the prostate", "PET CT scan", "Radical prostatectomy"], "correct": 0, "difficulty": 2},
{"id": "surgery_00952", "q": "A 23 year old recently married woman came to you with severe burning micturition together with frequency. Abdominal examination revealed tenderness over the bladder.Urine analysis revealed pyuria and bacteria count > 105/ml. the best management in this case would be:", "options": ["Obtain a urine sample by a Nelaton catheter for culture", "Cystoscopy", "Ciprofloxacin", "Incision and drainage"], "correct": 2, "difficulty": 2},
{"id": "surgery_00953", "q": "The best management of a palpable newly discovered breast cyst is:", "options": ["Follow up", "Aspiration", "Excision", "Wide local excision"], "correct": 1, "difficulty": 2},
{"id": "surgery_00954", "q": "A 35 years old female came to you with spontaneous bloody nipple discharge. On examination, there were no palpable masses and the discharge was coming from one duct. Mammography was normal. The best management is:", "options": ["Reassurance", "Check bleeding profile", "Do culture from the discharge", "Microdochectomy"], "correct": 3, "difficulty": 2},
{"id": "surgery_00955", "q": "Which of the following is a symptom of hypokalemia :", "options": ["ilius", "paralysis.", "cardiac arrest.", "all the above."], "correct": 3, "difficulty": 1},
{"id": "surgery_00956", "q": "A 32 year old lady came to you with a breast mass. Breast imaging showed no other abnormality apart from the swelling which showed to be cystic. Aspiration revealed clear fluid and the cyst totally disappeared. The next step should be:", "options": ["Follow-up in 2 weeks", "CA 15-3", "PET CT-scan", "Excision"], "correct": 0, "difficulty": 2},
{"id": "surgery_00957", "q": "A 30 years old female presents with bloody single duct discharge from the nipple. The most likely diagnosis is:", "options": ["Mammary duct ectasia.", "Fibroadenosis.", "Duct papilloma.", "Contraceptive pills intake.", "Hyperprolactinemia"], "correct": 2, "difficulty": 2},
{"id": "surgery_00958", "q": "Which hormone receptor status of breast carcinoma is more likely to respond to hormonal therapy?", "options": ["Estrogen receptor negative and progesterone receptor negative", "Estrogen receptor positive and progesterone receptor positive", "Estrogen receptor negative and progesterone receptor positive", "Estrogen receptor positive and progesterone receptor negative", "None of the above"], "correct": 1, "difficulty": 1},
{"id": "surgery_00959", "q": "After fine needle aspiration of a breast mass, an open biopsy is needed in all the following EXCEPT:", "options": ["Clear aspirate", "Residual mass", "Bloody aspirate", "Malignant cell count $>1000/ml$"], "correct": 0, "difficulty": 2},
{"id": "surgery_00960", "q": "In acute pancreatitis:", "options": ["may be caused by hypocalcemia", "gall stones are the commonest cause", "serum lipase is normal", "ERCP is indicated in all cases"], "correct": 1, "difficulty": 1},
{"id": "surgery_00961", "q": "In pancreatic pseudocyst,one of the following is false:", "options": ["they are developmental", "usually arise within the lesser sac", "produce a smooth epigastric mass", "may be effectively treated with internal drainage"], "correct": 0, "difficulty": 1},
{"id": "surgery_00962", "q": "Regarding pancreatic head cancer:", "options": ["tend to present early due to early involvement of distal common bile duct", "may be associated with gall bladder mass", "chemo and radiotherapy often offer a good alternative to surgery", "radical surgery applicable to all cases"], "correct": 1, "difficulty": 2},
{"id": "surgery_01383", "q": "The ends of the fracture are sclerosed in this type of complication:", "options": ["Malunion", "Delayed union", "Non union", "Sudek's atrophy"], "correct": 2, "difficulty": 1}
]